PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:42 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.1.4 *
       3;* Date/Time created: Sun Apr  9 14:25:42 2017                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("main_pru0.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.4 Copyright (c) 2012-2015 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/debian/bot/robocape/pru_firmware")
      12        .global __PRU_CREG_PRU_CFG
      13
      14$C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("start")
      15        .dwattr $C$DW$1, DW_AT_TI_symbol_name("start")
      16        .dwattr $C$DW$1, DW_AT_declaration
      17        .dwattr $C$DW$1, DW_AT_external
      18        .dwattr $C$DW$1, DW_AT_decl_file("main_pru0.c")
      19        .dwattr $C$DW$1, DW_AT_decl_line(0x2d)
      20        .dwattr $C$DW$1, DW_AT_decl_column(0x0d)

      69        .dwpsn  file "main_pru0.c",line 48,column 1,is_stmt,address ||main||,isa 0
      70
      71        .dwfde $C$DW$CIE, ||main||
      72;----------------------------------------------------------------------
      73;  47 | void main(void)                                                        
      74;----------------------------------------------------------------------
      75
      76;***************************************************************
      77;* FNAME: main                          FR SIZE:   2           *
      78;*                                                             *
      79;* FUNCTION ENVIRONMENT                                        *
      80;*                                                             *
      81;* FUNCTION PROPERTIES                                         *
      82;*                            0 Auto,  2 SOE     *
      83;***************************************************************
      84
      85 00000000                 ||main||:
      86;* --------------------------------------------------------------------------*
      87;* r0_0  assigned to $O$C1
      88        .dwcfi  cfa_offset, 0
      89 00000000 0000000502E2E2          SUB       r2, r2, 0x02          ; [ALU_PRU] 
      90        .dwcfi  cfa_offset, 2
      91        .dwpsn  file "main_pru0.c",line 50,column 2,is_stmt,isa 0
      92;----------------------------------------------------------------------
      93;  50 | CT_CFG.SYSCFG_bit.STANDBY_INIT = 0;                                    
      94;  52 | // Access PRU Shared RAM using Constant Table                    */    
      95;  53 | // C28 defaults to 0x00000000, we need to set bits 23:8 to 0x0100 in or
      96;     | der to have it point to 0x00010000        */                           
      97;----------------------------------------------------------------------
      98 00000004 00000091042080!         LBCO      &r0, __PRU_CREG_PRU_CFG, $CSBREL(||CT_CFG||+4), 4 ; [ALU_PRU] |50| CT_CFG
      99        .dwpsn  file "main_pru0.c",line 54,column 2,is_stmt,isa 0
     100;----------------------------------------------------------------------
     101;  54 | PRU0_CTRL.CTPPR0_bit.C28_BLK_POINTER = 0x0100;                         
     102;----------------------------------------------------------------------
     103 00000008 00008124FFFFC1          LDI32     r1, 0xffff0000        ; [ALU_PRU] |54| 
     104 00000010 000000E10002C3          SBBO      &r3.b2, r2, 0, 2      ; [ALU_PRU] 
     105        .dwcfi  save_reg_to_mem, 14, -2
     106        .dwcfi  save_reg_to_mem, 15, -1
     107        .dwpsn  file "main_pru0.c",line 50,column 2,is_stmt,isa 0
     108 00000014 0000001D04E0E0          CLR       r0, r0, 0x00000004    ; [ALU_PRU] |50| 
     109 00000018 00000081042080!         SBCO      &r0, __PRU_CREG_PRU_CFG, $CSBREL(||CT_CFG||+4), 4 ; [ALU_PRU] |50| CT_CFG
     110        .dwpsn  file "main_pru0.c",line 54,column 2,is_stmt,isa 0
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:42 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    3

     111 0000001c 202880240002C0          LDI32     r0, 0x00022028        ; [ALU_PRU] |54| $O$C1
     112 00000024 000000F100208E          LBBO      &r14, r0, 0, 4        ; [ALU_PRU] |54| $O$C1
     113 00000028 00000010E1EEE1          AND       r1, r14, r1           ; [ALU_PRU] |54| 
     114 0000002c 0000001F08E1E1          SET       r1, r1, 0x00000008    ; [ALU_PRU] |54| 
     115 00000030 000000E1002081          SBBO      &r1, r0, 0, 4         ; [ALU_PRU] |54| $O$C1
     116        .dwpsn  file "main_pru0.c",line 56,column 2,is_stmt,isa 0
     117;----------------------------------------------------------------------
     118;  56 | start();                                                               
     119;----------------------------------------------------------------------
     120$C$DW$5 .dwtag  DW_TAG_TI_branch
     121        .dwattr $C$DW$5, DW_AT_low_pc(0x00)
     122        .dwattr $C$DW$5, DW_AT_name("start")
     123        .dwattr $C$DW$5, DW_AT_TI_call
     124 00000034 000000230000C3!         JAL       r3.w2, ||start||      ; [ALU_PRU] |56| start
     125 00000038 000000F10002C3          LBBO      &r3.b2, r2, 0, 2      ; [ALU_PRU] 
     126        .dwcfi  restore_reg, 14
     127        .dwcfi  restore_reg, 15
     128 0000003c 0000000102E2E2          ADD       r2, r2, 0x02          ; [ALU_PRU] 
     129        .dwcfi  cfa_offset, 0
     130$C$DW$6 .dwtag  DW_TAG_TI_branch
     131        .dwattr $C$DW$6, DW_AT_low_pc(0x00)
     132        .dwattr $C$DW$6, DW_AT_TI_return
     133 00000040 00000020C30000          JMP       r3.w2                 ; [ALU_PRU] 
     134        .dwattr $C$DW$4, DW_AT_TI_end_file("main_pru0.c")
     135        .dwattr $C$DW$4, DW_AT_TI_end_line(0x39)
     136        .dwattr $C$DW$4, DW_AT_TI_end_column(0x01)
     137        .dwendentry
     138        .dwendtag $C$DW$4
     139
     140;*****************************************************************************
     141;* UNDEFINED EXTERNAL REFERENCES                                             *
     142;*****************************************************************************
     143        .global ||start||
     144
     145;******************************************************************************
     146;* TYPE INFORMATION                                                           *
     147;******************************************************************************
     148
     149$C$DW$T$19      .dwtag  DW_TAG_structure_type
     150        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
     151$C$DW$7 .dwtag  DW_TAG_member
     152        .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$11)
     153        .dwattr $C$DW$7, DW_AT_name("REVID")
     154        .dwattr $C$DW$7, DW_AT_TI_symbol_name("REVID")
     155        .dwattr $C$DW$7, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
     156        .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     157        .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     158        .dwattr $C$DW$7, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru_
     159        .dwattr $C$DW$7, DW_AT_decl_line(0x2d)
     160        .dwattr $C$DW$7, DW_AT_decl_column(0x0d)
     161        .dwendtag $C$DW$T$19
     162
     163        .dwattr $C$DW$T$19, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     164        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
     165        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:42 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    4

     166$C$DW$T$48      .dwtag  DW_TAG_volatile_type
     167        .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$19)
     168
     169$C$DW$T$20      .dwtag  DW_TAG_structure_type
     170        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     171$C$DW$8 .dwtag  DW_TAG_member
     172        .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$11)
     173        .dwattr $C$DW$8, DW_AT_name("IDLE_MODE")
     174        .dwattr $C$DW$8, DW_AT_TI_symbol_name("IDLE_MODE")
     175        .dwattr $C$DW$8, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     176        .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     177        .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     178        .dwattr $C$DW$8, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru_
     179        .dwattr $C$DW$8, DW_AT_decl_line(0x37)
     180        .dwattr $C$DW$8, DW_AT_decl_column(0x0d)
     181$C$DW$9 .dwtag  DW_TAG_member
     182        .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$11)
     183        .dwattr $C$DW$9, DW_AT_name("STANDBY_MODE")
     184        .dwattr $C$DW$9, DW_AT_TI_symbol_name("STANDBY_MODE")
     185        .dwattr $C$DW$9, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
     186        .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     187        .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     188        .dwattr $C$DW$9, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru_
     189        .dwattr $C$DW$9, DW_AT_decl_line(0x38)
     190        .dwattr $C$DW$9, DW_AT_decl_column(0x0d)
     191$C$DW$10        .dwtag  DW_TAG_member
     192        .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$11)
     193        .dwattr $C$DW$10, DW_AT_name("STANDBY_INIT")
     194        .dwattr $C$DW$10, DW_AT_TI_symbol_name("STANDBY_INIT")
     195        .dwattr $C$DW$10, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     196        .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     197        .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     198        .dwattr $C$DW$10, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     199        .dwattr $C$DW$10, DW_AT_decl_line(0x39)
     200        .dwattr $C$DW$10, DW_AT_decl_column(0x0d)
     201$C$DW$11        .dwtag  DW_TAG_member
     202        .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$11)
     203        .dwattr $C$DW$11, DW_AT_name("SUB_MWAIT")
     204        .dwattr $C$DW$11, DW_AT_TI_symbol_name("SUB_MWAIT")
     205        .dwattr $C$DW$11, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     206        .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     207        .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     208        .dwattr $C$DW$11, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     209        .dwattr $C$DW$11, DW_AT_decl_line(0x3a)
     210        .dwattr $C$DW$11, DW_AT_decl_column(0x0d)
     211$C$DW$12        .dwtag  DW_TAG_member
     212        .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$11)
     213        .dwattr $C$DW$12, DW_AT_name("rsvd6")
     214        .dwattr $C$DW$12, DW_AT_TI_symbol_name("rsvd6")
     215        .dwattr $C$DW$12, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1a)
     216        .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     217        .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     218        .dwattr $C$DW$12, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     219        .dwattr $C$DW$12, DW_AT_decl_line(0x3b)
     220        .dwattr $C$DW$12, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:42 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    5

     221        .dwendtag $C$DW$T$20
     222
     223        .dwattr $C$DW$T$20, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     224        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
     225        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
     226$C$DW$T$50      .dwtag  DW_TAG_volatile_type
     227        .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$20)
     228
     229$C$DW$T$21      .dwtag  DW_TAG_structure_type
     230        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
     231$C$DW$13        .dwtag  DW_TAG_member
     232        .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$11)
     233        .dwattr $C$DW$13, DW_AT_name("PRU0_GPI_MODE")
     234        .dwattr $C$DW$13, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
     235        .dwattr $C$DW$13, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     236        .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     237        .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     238        .dwattr $C$DW$13, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     239        .dwattr $C$DW$13, DW_AT_decl_line(0x45)
     240        .dwattr $C$DW$13, DW_AT_decl_column(0x0d)
     241$C$DW$14        .dwtag  DW_TAG_member
     242        .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$11)
     243        .dwattr $C$DW$14, DW_AT_name("PRU0_GPI_CLK_MODE")
     244        .dwattr $C$DW$14, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
     245        .dwattr $C$DW$14, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     246        .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     247        .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     248        .dwattr $C$DW$14, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     249        .dwattr $C$DW$14, DW_AT_decl_line(0x46)
     250        .dwattr $C$DW$14, DW_AT_decl_column(0x0d)
     251$C$DW$15        .dwtag  DW_TAG_member
     252        .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$11)
     253        .dwattr $C$DW$15, DW_AT_name("PRU0_GPI_DIV0")
     254        .dwattr $C$DW$15, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
     255        .dwattr $C$DW$15, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     256        .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     257        .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     258        .dwattr $C$DW$15, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     259        .dwattr $C$DW$15, DW_AT_decl_line(0x47)
     260        .dwattr $C$DW$15, DW_AT_decl_column(0x0d)
     261$C$DW$16        .dwtag  DW_TAG_member
     262        .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$11)
     263        .dwattr $C$DW$16, DW_AT_name("PRU0_GPI_DIV1")
     264        .dwattr $C$DW$16, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
     265        .dwattr $C$DW$16, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     266        .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     267        .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     268        .dwattr $C$DW$16, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     269        .dwattr $C$DW$16, DW_AT_decl_line(0x48)
     270        .dwattr $C$DW$16, DW_AT_decl_column(0x0d)
     271$C$DW$17        .dwtag  DW_TAG_member
     272        .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$11)
     273        .dwattr $C$DW$17, DW_AT_name("PRU0_GPI_SB")
     274        .dwattr $C$DW$17, DW_AT_TI_symbol_name("PRU0_GPI_SB")
     275        .dwattr $C$DW$17, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:42 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    6

     276        .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     277        .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     278        .dwattr $C$DW$17, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     279        .dwattr $C$DW$17, DW_AT_decl_line(0x49)
     280        .dwattr $C$DW$17, DW_AT_decl_column(0x0d)
     281$C$DW$18        .dwtag  DW_TAG_member
     282        .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$11)
     283        .dwattr $C$DW$18, DW_AT_name("PRU0_GPO_MODE")
     284        .dwattr $C$DW$18, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
     285        .dwattr $C$DW$18, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     286        .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     287        .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     288        .dwattr $C$DW$18, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     289        .dwattr $C$DW$18, DW_AT_decl_line(0x4a)
     290        .dwattr $C$DW$18, DW_AT_decl_column(0x0d)
     291$C$DW$19        .dwtag  DW_TAG_member
     292        .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$11)
     293        .dwattr $C$DW$19, DW_AT_name("PRU0_GPO_DIV0")
     294        .dwattr $C$DW$19, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
     295        .dwattr $C$DW$19, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     296        .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     297        .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     298        .dwattr $C$DW$19, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     299        .dwattr $C$DW$19, DW_AT_decl_line(0x4b)
     300        .dwattr $C$DW$19, DW_AT_decl_column(0x0d)
     301$C$DW$20        .dwtag  DW_TAG_member
     302        .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$11)
     303        .dwattr $C$DW$20, DW_AT_name("PRU0_GPO_DIV1")
     304        .dwattr $C$DW$20, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
     305        .dwattr $C$DW$20, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     306        .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     307        .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     308        .dwattr $C$DW$20, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     309        .dwattr $C$DW$20, DW_AT_decl_line(0x4c)
     310        .dwattr $C$DW$20, DW_AT_decl_column(0x0d)
     311$C$DW$21        .dwtag  DW_TAG_member
     312        .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$11)
     313        .dwattr $C$DW$21, DW_AT_name("PRU0_GPO_SH_SEL")
     314        .dwattr $C$DW$21, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
     315        .dwattr $C$DW$21, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     316        .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     317        .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     318        .dwattr $C$DW$21, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     319        .dwattr $C$DW$21, DW_AT_decl_line(0x4d)
     320        .dwattr $C$DW$21, DW_AT_decl_column(0x0d)
     321$C$DW$22        .dwtag  DW_TAG_member
     322        .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$11)
     323        .dwattr $C$DW$22, DW_AT_name("rsvd26")
     324        .dwattr $C$DW$22, DW_AT_TI_symbol_name("rsvd26")
     325        .dwattr $C$DW$22, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     326        .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     327        .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     328        .dwattr $C$DW$22, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     329        .dwattr $C$DW$22, DW_AT_decl_line(0x4e)
     330        .dwattr $C$DW$22, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:42 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    7

     331        .dwendtag $C$DW$T$21
     332
     333        .dwattr $C$DW$T$21, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     334        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
     335        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
     336$C$DW$T$52      .dwtag  DW_TAG_volatile_type
     337        .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$21)
     338
     339$C$DW$T$22      .dwtag  DW_TAG_structure_type
     340        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
     341$C$DW$23        .dwtag  DW_TAG_member
     342        .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$11)
     343        .dwattr $C$DW$23, DW_AT_name("PRU1_GPI_MODE")
     344        .dwattr $C$DW$23, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
     345        .dwattr $C$DW$23, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     346        .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     347        .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     348        .dwattr $C$DW$23, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     349        .dwattr $C$DW$23, DW_AT_decl_line(0x58)
     350        .dwattr $C$DW$23, DW_AT_decl_column(0x0d)
     351$C$DW$24        .dwtag  DW_TAG_member
     352        .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$11)
     353        .dwattr $C$DW$24, DW_AT_name("PRU1_GPI_CLK_MODE")
     354        .dwattr $C$DW$24, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
     355        .dwattr $C$DW$24, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     356        .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     357        .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     358        .dwattr $C$DW$24, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     359        .dwattr $C$DW$24, DW_AT_decl_line(0x59)
     360        .dwattr $C$DW$24, DW_AT_decl_column(0x0d)
     361$C$DW$25        .dwtag  DW_TAG_member
     362        .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$11)
     363        .dwattr $C$DW$25, DW_AT_name("PRU1_GPI_DIV0")
     364        .dwattr $C$DW$25, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
     365        .dwattr $C$DW$25, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     366        .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     367        .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     368        .dwattr $C$DW$25, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     369        .dwattr $C$DW$25, DW_AT_decl_line(0x5a)
     370        .dwattr $C$DW$25, DW_AT_decl_column(0x0d)
     371$C$DW$26        .dwtag  DW_TAG_member
     372        .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$11)
     373        .dwattr $C$DW$26, DW_AT_name("PRU1_GPI_DIV1")
     374        .dwattr $C$DW$26, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
     375        .dwattr $C$DW$26, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     376        .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     377        .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     378        .dwattr $C$DW$26, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     379        .dwattr $C$DW$26, DW_AT_decl_line(0x5b)
     380        .dwattr $C$DW$26, DW_AT_decl_column(0x0d)
     381$C$DW$27        .dwtag  DW_TAG_member
     382        .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$11)
     383        .dwattr $C$DW$27, DW_AT_name("PRU1_GPI_SB")
     384        .dwattr $C$DW$27, DW_AT_TI_symbol_name("PRU1_GPI_SB")
     385        .dwattr $C$DW$27, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:42 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    8

     386        .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     387        .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     388        .dwattr $C$DW$27, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     389        .dwattr $C$DW$27, DW_AT_decl_line(0x5c)
     390        .dwattr $C$DW$27, DW_AT_decl_column(0x0d)
     391$C$DW$28        .dwtag  DW_TAG_member
     392        .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$11)
     393        .dwattr $C$DW$28, DW_AT_name("PRU1_GPO_MODE")
     394        .dwattr $C$DW$28, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
     395        .dwattr $C$DW$28, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     396        .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     397        .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     398        .dwattr $C$DW$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     399        .dwattr $C$DW$28, DW_AT_decl_line(0x5d)
     400        .dwattr $C$DW$28, DW_AT_decl_column(0x0d)
     401$C$DW$29        .dwtag  DW_TAG_member
     402        .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$11)
     403        .dwattr $C$DW$29, DW_AT_name("PRU1_GPO_DIV0")
     404        .dwattr $C$DW$29, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
     405        .dwattr $C$DW$29, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     406        .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     407        .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     408        .dwattr $C$DW$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     409        .dwattr $C$DW$29, DW_AT_decl_line(0x5e)
     410        .dwattr $C$DW$29, DW_AT_decl_column(0x0d)
     411$C$DW$30        .dwtag  DW_TAG_member
     412        .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$11)
     413        .dwattr $C$DW$30, DW_AT_name("PRU1_GPO_DIV1")
     414        .dwattr $C$DW$30, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
     415        .dwattr $C$DW$30, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     416        .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     417        .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     418        .dwattr $C$DW$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     419        .dwattr $C$DW$30, DW_AT_decl_line(0x5f)
     420        .dwattr $C$DW$30, DW_AT_decl_column(0x0d)
     421$C$DW$31        .dwtag  DW_TAG_member
     422        .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$11)
     423        .dwattr $C$DW$31, DW_AT_name("PRU1_GPO_SH_SEL")
     424        .dwattr $C$DW$31, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
     425        .dwattr $C$DW$31, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     426        .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     427        .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     428        .dwattr $C$DW$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     429        .dwattr $C$DW$31, DW_AT_decl_line(0x60)
     430        .dwattr $C$DW$31, DW_AT_decl_column(0x0d)
     431$C$DW$32        .dwtag  DW_TAG_member
     432        .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$11)
     433        .dwattr $C$DW$32, DW_AT_name("rsvd26")
     434        .dwattr $C$DW$32, DW_AT_TI_symbol_name("rsvd26")
     435        .dwattr $C$DW$32, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     436        .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     437        .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     438        .dwattr $C$DW$32, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     439        .dwattr $C$DW$32, DW_AT_decl_line(0x61)
     440        .dwattr $C$DW$32, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:42 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE    9

     441        .dwendtag $C$DW$T$22
     442
     443        .dwattr $C$DW$T$22, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     444        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
     445        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
     446$C$DW$T$54      .dwtag  DW_TAG_volatile_type
     447        .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$22)
     448
     449$C$DW$T$23      .dwtag  DW_TAG_structure_type
     450        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
     451$C$DW$33        .dwtag  DW_TAG_member
     452        .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$11)
     453        .dwattr $C$DW$33, DW_AT_name("PRU0_CLK_STOP_REQ")
     454        .dwattr $C$DW$33, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
     455        .dwattr $C$DW$33, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     456        .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     457        .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     458        .dwattr $C$DW$33, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     459        .dwattr $C$DW$33, DW_AT_decl_line(0x6b)
     460        .dwattr $C$DW$33, DW_AT_decl_column(0x0d)
     461$C$DW$34        .dwtag  DW_TAG_member
     462        .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$11)
     463        .dwattr $C$DW$34, DW_AT_name("PRU0_CLK_STOP_ACK")
     464        .dwattr $C$DW$34, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
     465        .dwattr $C$DW$34, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
     466        .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     467        .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     468        .dwattr $C$DW$34, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     469        .dwattr $C$DW$34, DW_AT_decl_line(0x6c)
     470        .dwattr $C$DW$34, DW_AT_decl_column(0x0d)
     471$C$DW$35        .dwtag  DW_TAG_member
     472        .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$11)
     473        .dwattr $C$DW$35, DW_AT_name("PRU0_CLK_EN")
     474        .dwattr $C$DW$35, DW_AT_TI_symbol_name("PRU0_CLK_EN")
     475        .dwattr $C$DW$35, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     476        .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     477        .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     478        .dwattr $C$DW$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     479        .dwattr $C$DW$35, DW_AT_decl_line(0x6d)
     480        .dwattr $C$DW$35, DW_AT_decl_column(0x0d)
     481$C$DW$36        .dwtag  DW_TAG_member
     482        .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$11)
     483        .dwattr $C$DW$36, DW_AT_name("PRU1_CLK_STOP_REQ")
     484        .dwattr $C$DW$36, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
     485        .dwattr $C$DW$36, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
     486        .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     487        .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     488        .dwattr $C$DW$36, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     489        .dwattr $C$DW$36, DW_AT_decl_line(0x6e)
     490        .dwattr $C$DW$36, DW_AT_decl_column(0x0d)
     491$C$DW$37        .dwtag  DW_TAG_member
     492        .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$11)
     493        .dwattr $C$DW$37, DW_AT_name("PRU1_CLK_STOP_ACK")
     494        .dwattr $C$DW$37, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
     495        .dwattr $C$DW$37, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:42 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   10

     496        .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     497        .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     498        .dwattr $C$DW$37, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     499        .dwattr $C$DW$37, DW_AT_decl_line(0x6f)
     500        .dwattr $C$DW$37, DW_AT_decl_column(0x0d)
     501$C$DW$38        .dwtag  DW_TAG_member
     502        .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$11)
     503        .dwattr $C$DW$38, DW_AT_name("PRU1_CLK_EN")
     504        .dwattr $C$DW$38, DW_AT_TI_symbol_name("PRU1_CLK_EN")
     505        .dwattr $C$DW$38, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     506        .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     507        .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     508        .dwattr $C$DW$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     509        .dwattr $C$DW$38, DW_AT_decl_line(0x70)
     510        .dwattr $C$DW$38, DW_AT_decl_column(0x0d)
     511$C$DW$39        .dwtag  DW_TAG_member
     512        .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$11)
     513        .dwattr $C$DW$39, DW_AT_name("INTC_CLK_STOP_REQ")
     514        .dwattr $C$DW$39, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
     515        .dwattr $C$DW$39, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
     516        .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     517        .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     518        .dwattr $C$DW$39, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     519        .dwattr $C$DW$39, DW_AT_decl_line(0x71)
     520        .dwattr $C$DW$39, DW_AT_decl_column(0x0d)
     521$C$DW$40        .dwtag  DW_TAG_member
     522        .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$11)
     523        .dwattr $C$DW$40, DW_AT_name("INTC_CLK_STOP_ACK")
     524        .dwattr $C$DW$40, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
     525        .dwattr $C$DW$40, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
     526        .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     527        .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     528        .dwattr $C$DW$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     529        .dwattr $C$DW$40, DW_AT_decl_line(0x72)
     530        .dwattr $C$DW$40, DW_AT_decl_column(0x0d)
     531$C$DW$41        .dwtag  DW_TAG_member
     532        .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$11)
     533        .dwattr $C$DW$41, DW_AT_name("INTC_CLK_EN")
     534        .dwattr $C$DW$41, DW_AT_TI_symbol_name("INTC_CLK_EN")
     535        .dwattr $C$DW$41, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
     536        .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     537        .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     538        .dwattr $C$DW$41, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     539        .dwattr $C$DW$41, DW_AT_decl_line(0x73)
     540        .dwattr $C$DW$41, DW_AT_decl_column(0x0d)
     541$C$DW$42        .dwtag  DW_TAG_member
     542        .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$11)
     543        .dwattr $C$DW$42, DW_AT_name("UART_CLK_STOP_REQ")
     544        .dwattr $C$DW$42, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
     545        .dwattr $C$DW$42, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
     546        .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     547        .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     548        .dwattr $C$DW$42, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     549        .dwattr $C$DW$42, DW_AT_decl_line(0x74)
     550        .dwattr $C$DW$42, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:42 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   11

     551$C$DW$43        .dwtag  DW_TAG_member
     552        .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$11)
     553        .dwattr $C$DW$43, DW_AT_name("UART_CLK_STOP_ACK")
     554        .dwattr $C$DW$43, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
     555        .dwattr $C$DW$43, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
     556        .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     557        .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     558        .dwattr $C$DW$43, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     559        .dwattr $C$DW$43, DW_AT_decl_line(0x75)
     560        .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
     561$C$DW$44        .dwtag  DW_TAG_member
     562        .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$11)
     563        .dwattr $C$DW$44, DW_AT_name("UART_CLK_EN")
     564        .dwattr $C$DW$44, DW_AT_TI_symbol_name("UART_CLK_EN")
     565        .dwattr $C$DW$44, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
     566        .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     567        .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     568        .dwattr $C$DW$44, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     569        .dwattr $C$DW$44, DW_AT_decl_line(0x76)
     570        .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
     571$C$DW$45        .dwtag  DW_TAG_member
     572        .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$11)
     573        .dwattr $C$DW$45, DW_AT_name("ECAP_CLK_STOP_REQ")
     574        .dwattr $C$DW$45, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
     575        .dwattr $C$DW$45, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
     576        .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     577        .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     578        .dwattr $C$DW$45, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     579        .dwattr $C$DW$45, DW_AT_decl_line(0x77)
     580        .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
     581$C$DW$46        .dwtag  DW_TAG_member
     582        .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$11)
     583        .dwattr $C$DW$46, DW_AT_name("ECAP_CLK_STOP_ACK")
     584        .dwattr $C$DW$46, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
     585        .dwattr $C$DW$46, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     586        .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     587        .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     588        .dwattr $C$DW$46, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     589        .dwattr $C$DW$46, DW_AT_decl_line(0x78)
     590        .dwattr $C$DW$46, DW_AT_decl_column(0x0d)
     591$C$DW$47        .dwtag  DW_TAG_member
     592        .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$11)
     593        .dwattr $C$DW$47, DW_AT_name("ECAP_CLK_EN")
     594        .dwattr $C$DW$47, DW_AT_TI_symbol_name("ECAP_CLK_EN")
     595        .dwattr $C$DW$47, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     596        .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     597        .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     598        .dwattr $C$DW$47, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     599        .dwattr $C$DW$47, DW_AT_decl_line(0x79)
     600        .dwattr $C$DW$47, DW_AT_decl_column(0x0d)
     601$C$DW$48        .dwtag  DW_TAG_member
     602        .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$11)
     603        .dwattr $C$DW$48, DW_AT_name("IEP_CLK_STOP_REQ")
     604        .dwattr $C$DW$48, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
     605        .dwattr $C$DW$48, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:42 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   12

     606        .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     607        .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     608        .dwattr $C$DW$48, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     609        .dwattr $C$DW$48, DW_AT_decl_line(0x7a)
     610        .dwattr $C$DW$48, DW_AT_decl_column(0x0d)
     611$C$DW$49        .dwtag  DW_TAG_member
     612        .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$11)
     613        .dwattr $C$DW$49, DW_AT_name("IEP_CLK_STOP_ACK")
     614        .dwattr $C$DW$49, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
     615        .dwattr $C$DW$49, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     616        .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     617        .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     618        .dwattr $C$DW$49, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     619        .dwattr $C$DW$49, DW_AT_decl_line(0x7b)
     620        .dwattr $C$DW$49, DW_AT_decl_column(0x0d)
     621$C$DW$50        .dwtag  DW_TAG_member
     622        .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$11)
     623        .dwattr $C$DW$50, DW_AT_name("IEP_CLK_EN")
     624        .dwattr $C$DW$50, DW_AT_TI_symbol_name("IEP_CLK_EN")
     625        .dwattr $C$DW$50, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     626        .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     627        .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     628        .dwattr $C$DW$50, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     629        .dwattr $C$DW$50, DW_AT_decl_line(0x7c)
     630        .dwattr $C$DW$50, DW_AT_decl_column(0x0d)
     631$C$DW$51        .dwtag  DW_TAG_member
     632        .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$11)
     633        .dwattr $C$DW$51, DW_AT_name("rsvd18")
     634        .dwattr $C$DW$51, DW_AT_TI_symbol_name("rsvd18")
     635        .dwattr $C$DW$51, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     636        .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     637        .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     638        .dwattr $C$DW$51, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     639        .dwattr $C$DW$51, DW_AT_decl_line(0x7d)
     640        .dwattr $C$DW$51, DW_AT_decl_column(0x0d)
     641        .dwendtag $C$DW$T$23
     642
     643        .dwattr $C$DW$T$23, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     644        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
     645        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
     646$C$DW$T$56      .dwtag  DW_TAG_volatile_type
     647        .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$23)
     648
     649$C$DW$T$24      .dwtag  DW_TAG_structure_type
     650        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
     651$C$DW$52        .dwtag  DW_TAG_member
     652        .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$11)
     653        .dwattr $C$DW$52, DW_AT_name("PRU0_IMEM_PE_RAW")
     654        .dwattr $C$DW$52, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
     655        .dwattr $C$DW$52, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     656        .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     657        .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     658        .dwattr $C$DW$52, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     659        .dwattr $C$DW$52, DW_AT_decl_line(0x87)
     660        .dwattr $C$DW$52, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:42 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   13

     661$C$DW$53        .dwtag  DW_TAG_member
     662        .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$11)
     663        .dwattr $C$DW$53, DW_AT_name("PRU0_DMEM_PE_RAW")
     664        .dwattr $C$DW$53, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
     665        .dwattr $C$DW$53, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     666        .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     667        .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     668        .dwattr $C$DW$53, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     669        .dwattr $C$DW$53, DW_AT_decl_line(0x88)
     670        .dwattr $C$DW$53, DW_AT_decl_column(0x0d)
     671$C$DW$54        .dwtag  DW_TAG_member
     672        .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$11)
     673        .dwattr $C$DW$54, DW_AT_name("PRU1_IMEM_PE_RAW")
     674        .dwattr $C$DW$54, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
     675        .dwattr $C$DW$54, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     676        .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     677        .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     678        .dwattr $C$DW$54, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     679        .dwattr $C$DW$54, DW_AT_decl_line(0x89)
     680        .dwattr $C$DW$54, DW_AT_decl_column(0x0d)
     681$C$DW$55        .dwtag  DW_TAG_member
     682        .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$11)
     683        .dwattr $C$DW$55, DW_AT_name("PRU1_DMEM_PE_RAW")
     684        .dwattr $C$DW$55, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
     685        .dwattr $C$DW$55, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     686        .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     687        .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     688        .dwattr $C$DW$55, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     689        .dwattr $C$DW$55, DW_AT_decl_line(0x8a)
     690        .dwattr $C$DW$55, DW_AT_decl_column(0x0d)
     691$C$DW$56        .dwtag  DW_TAG_member
     692        .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$11)
     693        .dwattr $C$DW$56, DW_AT_name("RAM_PE_RAW")
     694        .dwattr $C$DW$56, DW_AT_TI_symbol_name("RAM_PE_RAW")
     695        .dwattr $C$DW$56, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     696        .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     697        .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     698        .dwattr $C$DW$56, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     699        .dwattr $C$DW$56, DW_AT_decl_line(0x8b)
     700        .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
     701$C$DW$57        .dwtag  DW_TAG_member
     702        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
     703        .dwattr $C$DW$57, DW_AT_name("rsvd20")
     704        .dwattr $C$DW$57, DW_AT_TI_symbol_name("rsvd20")
     705        .dwattr $C$DW$57, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     706        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     707        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     708        .dwattr $C$DW$57, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     709        .dwattr $C$DW$57, DW_AT_decl_line(0x8c)
     710        .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
     711        .dwendtag $C$DW$T$24
     712
     713        .dwattr $C$DW$T$24, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     714        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
     715        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:42 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   14

     716$C$DW$T$58      .dwtag  DW_TAG_volatile_type
     717        .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$24)
     718
     719$C$DW$T$25      .dwtag  DW_TAG_structure_type
     720        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
     721$C$DW$58        .dwtag  DW_TAG_member
     722        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
     723        .dwattr $C$DW$58, DW_AT_name("PRU0_IMEM_PE")
     724        .dwattr $C$DW$58, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
     725        .dwattr $C$DW$58, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     726        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     727        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     728        .dwattr $C$DW$58, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     729        .dwattr $C$DW$58, DW_AT_decl_line(0x96)
     730        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
     731$C$DW$59        .dwtag  DW_TAG_member
     732        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
     733        .dwattr $C$DW$59, DW_AT_name("PRU0_DMEM_PE")
     734        .dwattr $C$DW$59, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
     735        .dwattr $C$DW$59, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     736        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     737        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     738        .dwattr $C$DW$59, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     739        .dwattr $C$DW$59, DW_AT_decl_line(0x97)
     740        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
     741$C$DW$60        .dwtag  DW_TAG_member
     742        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
     743        .dwattr $C$DW$60, DW_AT_name("PRU1_IMEM_PE")
     744        .dwattr $C$DW$60, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
     745        .dwattr $C$DW$60, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     746        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     747        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     748        .dwattr $C$DW$60, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     749        .dwattr $C$DW$60, DW_AT_decl_line(0x98)
     750        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
     751$C$DW$61        .dwtag  DW_TAG_member
     752        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
     753        .dwattr $C$DW$61, DW_AT_name("PRU1_DMEM_PE")
     754        .dwattr $C$DW$61, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
     755        .dwattr $C$DW$61, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     756        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     757        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     758        .dwattr $C$DW$61, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     759        .dwattr $C$DW$61, DW_AT_decl_line(0x99)
     760        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
     761$C$DW$62        .dwtag  DW_TAG_member
     762        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
     763        .dwattr $C$DW$62, DW_AT_name("RAM_PE")
     764        .dwattr $C$DW$62, DW_AT_TI_symbol_name("RAM_PE")
     765        .dwattr $C$DW$62, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     766        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     767        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     768        .dwattr $C$DW$62, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     769        .dwattr $C$DW$62, DW_AT_decl_line(0x9a)
     770        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:42 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   15

     771$C$DW$63        .dwtag  DW_TAG_member
     772        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
     773        .dwattr $C$DW$63, DW_AT_name("rsvd20")
     774        .dwattr $C$DW$63, DW_AT_TI_symbol_name("rsvd20")
     775        .dwattr $C$DW$63, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     776        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     777        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     778        .dwattr $C$DW$63, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     779        .dwattr $C$DW$63, DW_AT_decl_line(0x9b)
     780        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
     781        .dwendtag $C$DW$T$25
     782
     783        .dwattr $C$DW$T$25, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     784        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
     785        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
     786$C$DW$T$60      .dwtag  DW_TAG_volatile_type
     787        .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$25)
     788
     789$C$DW$T$26      .dwtag  DW_TAG_structure_type
     790        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
     791$C$DW$64        .dwtag  DW_TAG_member
     792        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
     793        .dwattr $C$DW$64, DW_AT_name("PRU0_IMEM_PE_SET")
     794        .dwattr $C$DW$64, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
     795        .dwattr $C$DW$64, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     796        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     797        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     798        .dwattr $C$DW$64, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     799        .dwattr $C$DW$64, DW_AT_decl_line(0xa4)
     800        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
     801$C$DW$65        .dwtag  DW_TAG_member
     802        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
     803        .dwattr $C$DW$65, DW_AT_name("PRU0_DMEM_PE_SET")
     804        .dwattr $C$DW$65, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
     805        .dwattr $C$DW$65, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     806        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     807        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     808        .dwattr $C$DW$65, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     809        .dwattr $C$DW$65, DW_AT_decl_line(0xa5)
     810        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
     811$C$DW$66        .dwtag  DW_TAG_member
     812        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
     813        .dwattr $C$DW$66, DW_AT_name("PRU1_IMEM_PE_SET")
     814        .dwattr $C$DW$66, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
     815        .dwattr $C$DW$66, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     816        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     817        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     818        .dwattr $C$DW$66, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     819        .dwattr $C$DW$66, DW_AT_decl_line(0xa6)
     820        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
     821$C$DW$67        .dwtag  DW_TAG_member
     822        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
     823        .dwattr $C$DW$67, DW_AT_name("PRU1_DMEM_PE_SET")
     824        .dwattr $C$DW$67, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
     825        .dwattr $C$DW$67, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:42 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   16

     826        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     827        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     828        .dwattr $C$DW$67, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     829        .dwattr $C$DW$67, DW_AT_decl_line(0xa7)
     830        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
     831$C$DW$68        .dwtag  DW_TAG_member
     832        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
     833        .dwattr $C$DW$68, DW_AT_name("RAM_PE_SET")
     834        .dwattr $C$DW$68, DW_AT_TI_symbol_name("RAM_PE_SET")
     835        .dwattr $C$DW$68, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     836        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     837        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     838        .dwattr $C$DW$68, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     839        .dwattr $C$DW$68, DW_AT_decl_line(0xa8)
     840        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
     841$C$DW$69        .dwtag  DW_TAG_member
     842        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
     843        .dwattr $C$DW$69, DW_AT_name("rsvd20")
     844        .dwattr $C$DW$69, DW_AT_TI_symbol_name("rsvd20")
     845        .dwattr $C$DW$69, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     846        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     847        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     848        .dwattr $C$DW$69, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     849        .dwattr $C$DW$69, DW_AT_decl_line(0xa9)
     850        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
     851        .dwendtag $C$DW$T$26
     852
     853        .dwattr $C$DW$T$26, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     854        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
     855        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
     856$C$DW$T$62      .dwtag  DW_TAG_volatile_type
     857        .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$26)
     858
     859$C$DW$T$27      .dwtag  DW_TAG_structure_type
     860        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
     861$C$DW$70        .dwtag  DW_TAG_member
     862        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
     863        .dwattr $C$DW$70, DW_AT_name("PRU0_IMEM_PE_CLR")
     864        .dwattr $C$DW$70, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
     865        .dwattr $C$DW$70, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     866        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     867        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     868        .dwattr $C$DW$70, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     869        .dwattr $C$DW$70, DW_AT_decl_line(0xb3)
     870        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
     871$C$DW$71        .dwtag  DW_TAG_member
     872        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
     873        .dwattr $C$DW$71, DW_AT_name("PRU0_DMEM_PE_CLR")
     874        .dwattr $C$DW$71, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
     875        .dwattr $C$DW$71, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     876        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     877        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     878        .dwattr $C$DW$71, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     879        .dwattr $C$DW$71, DW_AT_decl_line(0xb4)
     880        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:42 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   17

     881$C$DW$72        .dwtag  DW_TAG_member
     882        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
     883        .dwattr $C$DW$72, DW_AT_name("PRU1_IMEM_PE_CLR")
     884        .dwattr $C$DW$72, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
     885        .dwattr $C$DW$72, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     886        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     887        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     888        .dwattr $C$DW$72, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     889        .dwattr $C$DW$72, DW_AT_decl_line(0xb5)
     890        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
     891$C$DW$73        .dwtag  DW_TAG_member
     892        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
     893        .dwattr $C$DW$73, DW_AT_name("PRU1_DMEM_PE_CLR")
     894        .dwattr $C$DW$73, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
     895        .dwattr $C$DW$73, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     896        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     897        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     898        .dwattr $C$DW$73, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     899        .dwattr $C$DW$73, DW_AT_decl_line(0xb6)
     900        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
     901$C$DW$74        .dwtag  DW_TAG_member
     902        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
     903        .dwattr $C$DW$74, DW_AT_name("rsvd16")
     904        .dwattr $C$DW$74, DW_AT_TI_symbol_name("rsvd16")
     905        .dwattr $C$DW$74, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     906        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     907        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     908        .dwattr $C$DW$74, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     909        .dwattr $C$DW$74, DW_AT_decl_line(0xb7)
     910        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
     911        .dwendtag $C$DW$T$27
     912
     913        .dwattr $C$DW$T$27, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     914        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
     915        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
     916$C$DW$T$64      .dwtag  DW_TAG_volatile_type
     917        .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$27)
     918
     919$C$DW$T$28      .dwtag  DW_TAG_structure_type
     920        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
     921$C$DW$75        .dwtag  DW_TAG_member
     922        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
     923        .dwattr $C$DW$75, DW_AT_name("PMAO_PRU0")
     924        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PMAO_PRU0")
     925        .dwattr $C$DW$75, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     926        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     927        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     928        .dwattr $C$DW$75, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     929        .dwattr $C$DW$75, DW_AT_decl_line(0xc4)
     930        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
     931$C$DW$76        .dwtag  DW_TAG_member
     932        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
     933        .dwattr $C$DW$76, DW_AT_name("PMAO_PRU1")
     934        .dwattr $C$DW$76, DW_AT_TI_symbol_name("PMAO_PRU1")
     935        .dwattr $C$DW$76, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:42 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   18

     936        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     937        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     938        .dwattr $C$DW$76, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     939        .dwattr $C$DW$76, DW_AT_decl_line(0xc5)
     940        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
     941$C$DW$77        .dwtag  DW_TAG_member
     942        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
     943        .dwattr $C$DW$77, DW_AT_name("rsvd2")
     944        .dwattr $C$DW$77, DW_AT_TI_symbol_name("rsvd2")
     945        .dwattr $C$DW$77, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
     946        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     947        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     948        .dwattr $C$DW$77, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     949        .dwattr $C$DW$77, DW_AT_decl_line(0xc6)
     950        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
     951        .dwendtag $C$DW$T$28
     952
     953        .dwattr $C$DW$T$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     954        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
     955        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
     956$C$DW$T$66      .dwtag  DW_TAG_volatile_type
     957        .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$28)
     958
     959$C$DW$T$29      .dwtag  DW_TAG_structure_type
     960        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
     961$C$DW$78        .dwtag  DW_TAG_member
     962        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
     963        .dwattr $C$DW$78, DW_AT_name("OCP_EN")
     964        .dwattr $C$DW$78, DW_AT_TI_symbol_name("OCP_EN")
     965        .dwattr $C$DW$78, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     966        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     967        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     968        .dwattr $C$DW$78, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     969        .dwattr $C$DW$78, DW_AT_decl_line(0xd3)
     970        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
     971$C$DW$79        .dwtag  DW_TAG_member
     972        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
     973        .dwattr $C$DW$79, DW_AT_name("rsvd1")
     974        .dwattr $C$DW$79, DW_AT_TI_symbol_name("rsvd1")
     975        .dwattr $C$DW$79, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
     976        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     977        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     978        .dwattr $C$DW$79, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     979        .dwattr $C$DW$79, DW_AT_decl_line(0xd4)
     980        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
     981        .dwendtag $C$DW$T$29
     982
     983        .dwattr $C$DW$T$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     984        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
     985        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
     986$C$DW$T$68      .dwtag  DW_TAG_volatile_type
     987        .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$29)
     988
     989$C$DW$T$30      .dwtag  DW_TAG_structure_type
     990        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:42 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   19

     991$C$DW$80        .dwtag  DW_TAG_member
     992        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
     993        .dwattr $C$DW$80, DW_AT_name("PRU1_PAD_HP_EN")
     994        .dwattr $C$DW$80, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
     995        .dwattr $C$DW$80, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     996        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     997        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     998        .dwattr $C$DW$80, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     999        .dwattr $C$DW$80, DW_AT_decl_line(0xde)
    1000        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1001$C$DW$81        .dwtag  DW_TAG_member
    1002        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1003        .dwattr $C$DW$81, DW_AT_name("XFR_SHIFT_EN")
    1004        .dwattr $C$DW$81, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    1005        .dwattr $C$DW$81, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1006        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1007        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1008        .dwattr $C$DW$81, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1009        .dwattr $C$DW$81, DW_AT_decl_line(0xdf)
    1010        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1011$C$DW$82        .dwtag  DW_TAG_member
    1012        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1013        .dwattr $C$DW$82, DW_AT_name("rsvd2")
    1014        .dwattr $C$DW$82, DW_AT_TI_symbol_name("rsvd2")
    1015        .dwattr $C$DW$82, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1016        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1017        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1018        .dwattr $C$DW$82, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1019        .dwattr $C$DW$82, DW_AT_decl_line(0xe0)
    1020        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1021        .dwendtag $C$DW$T$30
    1022
    1023        .dwattr $C$DW$T$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1024        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    1025        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    1026$C$DW$T$70      .dwtag  DW_TAG_volatile_type
    1027        .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$30)
    1028
    1029$C$DW$T$31      .dwtag  DW_TAG_structure_type
    1030        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1031$C$DW$83        .dwtag  DW_TAG_member
    1032        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1033        .dwattr $C$DW$83, DW_AT_name("PIN_MUX_SEL")
    1034        .dwattr $C$DW$83, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    1035        .dwattr $C$DW$83, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    1036        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1037        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1038        .dwattr $C$DW$83, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1039        .dwattr $C$DW$83, DW_AT_decl_line(0xec)
    1040        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1041$C$DW$84        .dwtag  DW_TAG_member
    1042        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1043        .dwattr $C$DW$84, DW_AT_name("rsvd2")
    1044        .dwattr $C$DW$84, DW_AT_TI_symbol_name("rsvd2")
    1045        .dwattr $C$DW$84, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:42 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   20

    1046        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1047        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1048        .dwattr $C$DW$84, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1049        .dwattr $C$DW$84, DW_AT_decl_line(0xed)
    1050        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1051        .dwendtag $C$DW$T$31
    1052
    1053        .dwattr $C$DW$T$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1054        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    1055        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    1056$C$DW$T$72      .dwtag  DW_TAG_volatile_type
    1057        .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$31)
    1058
    1059$C$DW$T$35      .dwtag  DW_TAG_structure_type
    1060        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    1061$C$DW$85        .dwtag  DW_TAG_member
    1062        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$49)
    1063        .dwattr $C$DW$85, DW_AT_name("$P$T0")
    1064        .dwattr $C$DW$85, DW_AT_TI_symbol_name("$P$T0")
    1065        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1066        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1067        .dwattr $C$DW$85, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1068        .dwattr $C$DW$85, DW_AT_decl_line(0x29)
    1069        .dwattr $C$DW$85, DW_AT_decl_column(0x02)
    1070$C$DW$86        .dwtag  DW_TAG_member
    1071        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$51)
    1072        .dwattr $C$DW$86, DW_AT_name("$P$T1")
    1073        .dwattr $C$DW$86, DW_AT_TI_symbol_name("$P$T1")
    1074        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1075        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1076        .dwattr $C$DW$86, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1077        .dwattr $C$DW$86, DW_AT_decl_line(0x33)
    1078        .dwattr $C$DW$86, DW_AT_decl_column(0x02)
    1079$C$DW$87        .dwtag  DW_TAG_member
    1080        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$53)
    1081        .dwattr $C$DW$87, DW_AT_name("$P$T2")
    1082        .dwattr $C$DW$87, DW_AT_TI_symbol_name("$P$T2")
    1083        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1084        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1085        .dwattr $C$DW$87, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1086        .dwattr $C$DW$87, DW_AT_decl_line(0x41)
    1087        .dwattr $C$DW$87, DW_AT_decl_column(0x02)
    1088$C$DW$88        .dwtag  DW_TAG_member
    1089        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$55)
    1090        .dwattr $C$DW$88, DW_AT_name("$P$T3")
    1091        .dwattr $C$DW$88, DW_AT_TI_symbol_name("$P$T3")
    1092        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1093        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1094        .dwattr $C$DW$88, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1095        .dwattr $C$DW$88, DW_AT_decl_line(0x54)
    1096        .dwattr $C$DW$88, DW_AT_decl_column(0x02)
    1097$C$DW$89        .dwtag  DW_TAG_member
    1098        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$57)
    1099        .dwattr $C$DW$89, DW_AT_name("$P$T4")
    1100        .dwattr $C$DW$89, DW_AT_TI_symbol_name("$P$T4")
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:42 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   21

    1101        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1102        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1103        .dwattr $C$DW$89, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1104        .dwattr $C$DW$89, DW_AT_decl_line(0x67)
    1105        .dwattr $C$DW$89, DW_AT_decl_column(0x02)
    1106$C$DW$90        .dwtag  DW_TAG_member
    1107        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$59)
    1108        .dwattr $C$DW$90, DW_AT_name("$P$T5")
    1109        .dwattr $C$DW$90, DW_AT_TI_symbol_name("$P$T5")
    1110        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1111        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1112        .dwattr $C$DW$90, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1113        .dwattr $C$DW$90, DW_AT_decl_line(0x83)
    1114        .dwattr $C$DW$90, DW_AT_decl_column(0x02)
    1115$C$DW$91        .dwtag  DW_TAG_member
    1116        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$61)
    1117        .dwattr $C$DW$91, DW_AT_name("$P$T6")
    1118        .dwattr $C$DW$91, DW_AT_TI_symbol_name("$P$T6")
    1119        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1120        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1121        .dwattr $C$DW$91, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1122        .dwattr $C$DW$91, DW_AT_decl_line(0x92)
    1123        .dwattr $C$DW$91, DW_AT_decl_column(0x02)
    1124$C$DW$92        .dwtag  DW_TAG_member
    1125        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$63)
    1126        .dwattr $C$DW$92, DW_AT_name("$P$T7")
    1127        .dwattr $C$DW$92, DW_AT_TI_symbol_name("$P$T7")
    1128        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1129        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1130        .dwattr $C$DW$92, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1131        .dwattr $C$DW$92, DW_AT_decl_line(0xa0)
    1132        .dwattr $C$DW$92, DW_AT_decl_column(0x02)
    1133$C$DW$93        .dwtag  DW_TAG_member
    1134        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$65)
    1135        .dwattr $C$DW$93, DW_AT_name("$P$T8")
    1136        .dwattr $C$DW$93, DW_AT_TI_symbol_name("$P$T8")
    1137        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1138        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1139        .dwattr $C$DW$93, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1140        .dwattr $C$DW$93, DW_AT_decl_line(0xaf)
    1141        .dwattr $C$DW$93, DW_AT_decl_column(0x02)
    1142$C$DW$94        .dwtag  DW_TAG_member
    1143        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$32)
    1144        .dwattr $C$DW$94, DW_AT_name("rsvd24")
    1145        .dwattr $C$DW$94, DW_AT_TI_symbol_name("rsvd24")
    1146        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1147        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1148        .dwattr $C$DW$94, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1149        .dwattr $C$DW$94, DW_AT_decl_line(0xbc)
    1150        .dwattr $C$DW$94, DW_AT_decl_column(0x0b)
    1151$C$DW$95        .dwtag  DW_TAG_member
    1152        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$67)
    1153        .dwattr $C$DW$95, DW_AT_name("$P$T9")
    1154        .dwattr $C$DW$95, DW_AT_TI_symbol_name("$P$T9")
    1155        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:42 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   22

    1156        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1157        .dwattr $C$DW$95, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1158        .dwattr $C$DW$95, DW_AT_decl_line(0xc0)
    1159        .dwattr $C$DW$95, DW_AT_decl_column(0x02)
    1160$C$DW$96        .dwtag  DW_TAG_member
    1161        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$33)
    1162        .dwattr $C$DW$96, DW_AT_name("rsvd2c")
    1163        .dwattr $C$DW$96, DW_AT_TI_symbol_name("rsvd2c")
    1164        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1165        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1166        .dwattr $C$DW$96, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1167        .dwattr $C$DW$96, DW_AT_decl_line(0xcb)
    1168        .dwattr $C$DW$96, DW_AT_decl_column(0x0b)
    1169$C$DW$97        .dwtag  DW_TAG_member
    1170        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$69)
    1171        .dwattr $C$DW$97, DW_AT_name("$P$T10")
    1172        .dwattr $C$DW$97, DW_AT_TI_symbol_name("$P$T10")
    1173        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1174        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1175        .dwattr $C$DW$97, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1176        .dwattr $C$DW$97, DW_AT_decl_line(0xcf)
    1177        .dwattr $C$DW$97, DW_AT_decl_column(0x02)
    1178$C$DW$98        .dwtag  DW_TAG_member
    1179        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$71)
    1180        .dwattr $C$DW$98, DW_AT_name("$P$T11")
    1181        .dwattr $C$DW$98, DW_AT_TI_symbol_name("$P$T11")
    1182        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1183        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1184        .dwattr $C$DW$98, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1185        .dwattr $C$DW$98, DW_AT_decl_line(0xda)
    1186        .dwattr $C$DW$98, DW_AT_decl_column(0x02)
    1187$C$DW$99        .dwtag  DW_TAG_member
    1188        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$34)
    1189        .dwattr $C$DW$99, DW_AT_name("rsvd38")
    1190        .dwattr $C$DW$99, DW_AT_TI_symbol_name("rsvd38")
    1191        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1192        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1193        .dwattr $C$DW$99, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1194        .dwattr $C$DW$99, DW_AT_decl_line(0xe5)
    1195        .dwattr $C$DW$99, DW_AT_decl_column(0x0b)
    1196$C$DW$100       .dwtag  DW_TAG_member
    1197        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$73)
    1198        .dwattr $C$DW$100, DW_AT_name("$P$T12")
    1199        .dwattr $C$DW$100, DW_AT_TI_symbol_name("$P$T12")
    1200        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1201        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1202        .dwattr $C$DW$100, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1203        .dwattr $C$DW$100, DW_AT_decl_line(0xe8)
    1204        .dwattr $C$DW$100, DW_AT_decl_column(0x02)
    1205        .dwendtag $C$DW$T$35
    1206
    1207        .dwattr $C$DW$T$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1208        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    1209        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1210$C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("pruCfg")
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:42 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   23

    1211        .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$35)
    1212        .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    1213        .dwattr $C$DW$T$97, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1214        .dwattr $C$DW$T$97, DW_AT_decl_line(0xf0)
    1215        .dwattr $C$DW$T$97, DW_AT_decl_column(0x03)
    1216$C$DW$T$98      .dwtag  DW_TAG_volatile_type
    1217        .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$97)
    1218
    1219$C$DW$T$36      .dwtag  DW_TAG_structure_type
    1220        .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    1221$C$DW$101       .dwtag  DW_TAG_member
    1222        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1223        .dwattr $C$DW$101, DW_AT_name("C28_BLK_POINTER")
    1224        .dwattr $C$DW$101, DW_AT_TI_symbol_name("C28_BLK_POINTER")
    1225        .dwattr $C$DW$101, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x10)
    1226        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1227        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1228        .dwattr $C$DW$101, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1229        .dwattr $C$DW$101, DW_AT_decl_line(0x85)
    1230        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1231$C$DW$102       .dwtag  DW_TAG_member
    1232        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1233        .dwattr $C$DW$102, DW_AT_name("C29_BLK_POINTER")
    1234        .dwattr $C$DW$102, DW_AT_TI_symbol_name("C29_BLK_POINTER")
    1235        .dwattr $C$DW$102, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1236        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1237        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1238        .dwattr $C$DW$102, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1239        .dwattr $C$DW$102, DW_AT_decl_line(0x86)
    1240        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1241        .dwendtag $C$DW$T$36
    1242
    1243        .dwattr $C$DW$T$36, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1244        .dwattr $C$DW$T$36, DW_AT_decl_line(0x84)
    1245        .dwattr $C$DW$T$36, DW_AT_decl_column(0x13)
    1246$C$DW$T$74      .dwtag  DW_TAG_volatile_type
    1247        .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$36)
    1248
    1249$C$DW$T$37      .dwtag  DW_TAG_structure_type
    1250        .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    1251$C$DW$103       .dwtag  DW_TAG_member
    1252        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1253        .dwattr $C$DW$103, DW_AT_name("SOFT_RST_N")
    1254        .dwattr $C$DW$103, DW_AT_TI_symbol_name("SOFT_RST_N")
    1255        .dwattr $C$DW$103, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1256        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1257        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1258        .dwattr $C$DW$103, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1259        .dwattr $C$DW$103, DW_AT_decl_line(0x2d)
    1260        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1261$C$DW$104       .dwtag  DW_TAG_member
    1262        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1263        .dwattr $C$DW$104, DW_AT_name("EN")
    1264        .dwattr $C$DW$104, DW_AT_TI_symbol_name("EN")
    1265        .dwattr $C$DW$104, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:42 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   24

    1266        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1267        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1268        .dwattr $C$DW$104, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1269        .dwattr $C$DW$104, DW_AT_decl_line(0x2e)
    1270        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1271$C$DW$105       .dwtag  DW_TAG_member
    1272        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    1273        .dwattr $C$DW$105, DW_AT_name("SLEEPING")
    1274        .dwattr $C$DW$105, DW_AT_TI_symbol_name("SLEEPING")
    1275        .dwattr $C$DW$105, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1276        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1277        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1278        .dwattr $C$DW$105, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1279        .dwattr $C$DW$105, DW_AT_decl_line(0x2f)
    1280        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    1281$C$DW$106       .dwtag  DW_TAG_member
    1282        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    1283        .dwattr $C$DW$106, DW_AT_name("CTR_EN")
    1284        .dwattr $C$DW$106, DW_AT_TI_symbol_name("CTR_EN")
    1285        .dwattr $C$DW$106, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
    1286        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1287        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1288        .dwattr $C$DW$106, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1289        .dwattr $C$DW$106, DW_AT_decl_line(0x30)
    1290        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1291$C$DW$107       .dwtag  DW_TAG_member
    1292        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
    1293        .dwattr $C$DW$107, DW_AT_name("rsvd4")
    1294        .dwattr $C$DW$107, DW_AT_TI_symbol_name("rsvd4")
    1295        .dwattr $C$DW$107, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1296        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1297        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1298        .dwattr $C$DW$107, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1299        .dwattr $C$DW$107, DW_AT_decl_line(0x31)
    1300        .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    1301$C$DW$108       .dwtag  DW_TAG_member
    1302        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$11)
    1303        .dwattr $C$DW$108, DW_AT_name("SINGLE_STEP")
    1304        .dwattr $C$DW$108, DW_AT_TI_symbol_name("SINGLE_STEP")
    1305        .dwattr $C$DW$108, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
    1306        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1307        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1308        .dwattr $C$DW$108, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1309        .dwattr $C$DW$108, DW_AT_decl_line(0x32)
    1310        .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    1311$C$DW$109       .dwtag  DW_TAG_member
    1312        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$11)
    1313        .dwattr $C$DW$109, DW_AT_name("rsvd9")
    1314        .dwattr $C$DW$109, DW_AT_TI_symbol_name("rsvd9")
    1315        .dwattr $C$DW$109, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x06)
    1316        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1317        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1318        .dwattr $C$DW$109, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1319        .dwattr $C$DW$109, DW_AT_decl_line(0x33)
    1320        .dwattr $C$DW$109, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:42 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   25

    1321$C$DW$110       .dwtag  DW_TAG_member
    1322        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$11)
    1323        .dwattr $C$DW$110, DW_AT_name("RUNSTATE")
    1324        .dwattr $C$DW$110, DW_AT_TI_symbol_name("RUNSTATE")
    1325        .dwattr $C$DW$110, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
    1326        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1327        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1328        .dwattr $C$DW$110, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1329        .dwattr $C$DW$110, DW_AT_decl_line(0x34)
    1330        .dwattr $C$DW$110, DW_AT_decl_column(0x0d)
    1331$C$DW$111       .dwtag  DW_TAG_member
    1332        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$11)
    1333        .dwattr $C$DW$111, DW_AT_name("PCTR_RST_VAL")
    1334        .dwattr $C$DW$111, DW_AT_TI_symbol_name("PCTR_RST_VAL")
    1335        .dwattr $C$DW$111, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1336        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1337        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1338        .dwattr $C$DW$111, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1339        .dwattr $C$DW$111, DW_AT_decl_line(0x35)
    1340        .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    1341        .dwendtag $C$DW$T$37
    1342
    1343        .dwattr $C$DW$T$37, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1344        .dwattr $C$DW$T$37, DW_AT_decl_line(0x2c)
    1345        .dwattr $C$DW$T$37, DW_AT_decl_column(0x13)
    1346$C$DW$T$76      .dwtag  DW_TAG_volatile_type
    1347        .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$37)
    1348
    1349$C$DW$T$38      .dwtag  DW_TAG_structure_type
    1350        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    1351$C$DW$112       .dwtag  DW_TAG_member
    1352        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
    1353        .dwattr $C$DW$112, DW_AT_name("PCTR")
    1354        .dwattr $C$DW$112, DW_AT_TI_symbol_name("PCTR")
    1355        .dwattr $C$DW$112, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x10)
    1356        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1357        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1358        .dwattr $C$DW$112, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1359        .dwattr $C$DW$112, DW_AT_decl_line(0x3f)
    1360        .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    1361$C$DW$113       .dwtag  DW_TAG_member
    1362        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
    1363        .dwattr $C$DW$113, DW_AT_name("rsvd16")
    1364        .dwattr $C$DW$113, DW_AT_TI_symbol_name("rsvd16")
    1365        .dwattr $C$DW$113, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1366        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1367        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1368        .dwattr $C$DW$113, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1369        .dwattr $C$DW$113, DW_AT_decl_line(0x40)
    1370        .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    1371        .dwendtag $C$DW$T$38
    1372
    1373        .dwattr $C$DW$T$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1374        .dwattr $C$DW$T$38, DW_AT_decl_line(0x3e)
    1375        .dwattr $C$DW$T$38, DW_AT_decl_column(0x13)
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:42 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   26

    1376$C$DW$T$78      .dwtag  DW_TAG_volatile_type
    1377        .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$38)
    1378
    1379$C$DW$T$39      .dwtag  DW_TAG_structure_type
    1380        .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    1381$C$DW$114       .dwtag  DW_TAG_member
    1382        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    1383        .dwattr $C$DW$114, DW_AT_name("BITWISE_ENS")
    1384        .dwattr $C$DW$114, DW_AT_TI_symbol_name("BITWISE_ENS")
    1385        .dwattr $C$DW$114, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    1386        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1387        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1388        .dwattr $C$DW$114, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1389        .dwattr $C$DW$114, DW_AT_decl_line(0x4a)
    1390        .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    1391        .dwendtag $C$DW$T$39
    1392
    1393        .dwattr $C$DW$T$39, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1394        .dwattr $C$DW$T$39, DW_AT_decl_line(0x49)
    1395        .dwattr $C$DW$T$39, DW_AT_decl_column(0x13)
    1396$C$DW$T$80      .dwtag  DW_TAG_volatile_type
    1397        .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$39)
    1398
    1399$C$DW$T$40      .dwtag  DW_TAG_structure_type
    1400        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    1401$C$DW$115       .dwtag  DW_TAG_member
    1402        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
    1403        .dwattr $C$DW$115, DW_AT_name("CYCLECOUNT")
    1404        .dwattr $C$DW$115, DW_AT_TI_symbol_name("CYCLECOUNT")
    1405        .dwattr $C$DW$115, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    1406        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1407        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1408        .dwattr $C$DW$115, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1409        .dwattr $C$DW$115, DW_AT_decl_line(0x54)
    1410        .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    1411        .dwendtag $C$DW$T$40
    1412
    1413        .dwattr $C$DW$T$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1414        .dwattr $C$DW$T$40, DW_AT_decl_line(0x53)
    1415        .dwattr $C$DW$T$40, DW_AT_decl_column(0x13)
    1416$C$DW$T$82      .dwtag  DW_TAG_volatile_type
    1417        .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$40)
    1418
    1419$C$DW$T$41      .dwtag  DW_TAG_structure_type
    1420        .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    1421$C$DW$116       .dwtag  DW_TAG_member
    1422        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$11)
    1423        .dwattr $C$DW$116, DW_AT_name("STALLCOUNT")
    1424        .dwattr $C$DW$116, DW_AT_TI_symbol_name("STALLCOUNT")
    1425        .dwattr $C$DW$116, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    1426        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1427        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1428        .dwattr $C$DW$116, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1429        .dwattr $C$DW$116, DW_AT_decl_line(0x5e)
    1430        .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:42 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru0.asm                                                        PAGE   27

    1431        .dwendtag $C$DW$T$41
    1432
    1433        .dwattr $C$DW$T$41, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1434        .dwattr $C$DW$T$41, DW_AT_decl_line(0x5d)
    1435        .dwattr $C$DW$T$41, DW_AT_decl_column(0x14)
    1436$C$DW$T$84      .dwtag  DW_TAG_volatile_type
    1437        .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$41)
    1438
    1439$C$DW$T$42      .dwtag  DW_TAG_structure_type
    1440        .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
    1441$C$DW$117       .dwtag  DW_TAG_member
    1442        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$11)
    1443        .dwattr $C$DW$117, DW_AT_name("C24_BLK_IDX")
    1444        .dwattr $C$DW$117, DW_AT_TI_symbol_name("C24_BLK_IDX")
    1445        .dwattr $C$DW$117, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    1446        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1447        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1448        .dwattr $C$DW$117, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1449        .dwattr $C$DW$117, DW_AT_decl_line(0x6b)
    1450        .dwattr $C$DW$117, DW_AT_decl_column(0x0d)
    1451$C$DW$118       .dwtag  DW_TAG_member
    1452        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$11)
    1453        .dwattr $C$DW$118, DW_AT_name("rsvd8")
    1454        .dwattr $C$DW$118, DW_AT_TI_symbol_name("rsvd8")
    1455        .dwattr $C$DW$118, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x08)
    1456        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1457        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1458        .dwattr $C$DW$118, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1459        .dwattr $C$DW$118, DW_AT_decl_line(0x6c)
    1460        .dwattr $C$DW$118, DW_AT_decl_column(0x0d)
    1461$C$DW$119       .dwtag  DW_TAG_member
    1462        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$11)
    1463        .dwattr $C$DW$119, DW_AT_name("C25_BLK_IDX")
    1464        .dwattr $C$DW$119, DW_AT_TI_symbol_name("C25_BLK_IDX")
    1465        .dwattr $C$DW$119, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1466        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1467        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1468        .dwattr $C$DW$119, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1469        .dwattr $C$DW$119, DW_AT_decl_line(0x6d)
    1470        .dwattr $C$DW$119, DW_AT_decl_column(0x0d)
    1471$C$DW$120       .dwtag  DW_TAG_member
    1472        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$11)
    1473        .dwattr $C$DW$120, DW_AT_name("rsvd24")
    1474        .dwattr $C$DW$120, DW_AT_TI_symbol_name("rsvd24")
    1475        .dwattr $C$DW$120, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
