PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:41 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.1.4 *
       3;* Date/Time created: Sun Apr  9 14:25:41 2017                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("main_pru1.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.4 Copyright (c) 2012-2015 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/home/debian/bot/robocape/pru_firmware")
      12        .global __PRU_CREG_PRU_CFG
      13
      14$C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("start")
      15        .dwattr $C$DW$1, DW_AT_TI_symbol_name("start")
      16        .dwattr $C$DW$1, DW_AT_declaration
      17        .dwattr $C$DW$1, DW_AT_external
      18        .dwattr $C$DW$1, DW_AT_decl_file("main_pru1.c")
      19        .dwattr $C$DW$1, DW_AT_decl_line(0x2c)
      20        .dwattr $C$DW$1, DW_AT_decl_column(0x0d)

      48        .dwattr $C$DW$3, DW_AT_decl_file("resource_table_pru1.h")
      49        .dwattr $C$DW$3, DW_AT_decl_line(0x40)
      50        .dwattr $C$DW$3, DW_AT_decl_column(0x1a)
      51;       /usr/bin/optpru /tmp/04752OZIGyn /tmp/04752G43pWA 
      52;       /usr/bin/acpiapru -@/tmp/047529nVrHl 
      53 00000000                         .sect   ".text:main"
      54        .clink
      55        .global ||main||
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:41 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE    2

      56
      57$C$DW$4 .dwtag  DW_TAG_subprogram, DW_AT_name("main")
      58        .dwattr $C$DW$4, DW_AT_low_pc(||main||)
      59        .dwattr $C$DW$4, DW_AT_high_pc(0x00)
      60        .dwattr $C$DW$4, DW_AT_TI_symbol_name("main")
      61        .dwattr $C$DW$4, DW_AT_external
      62        .dwattr $C$DW$4, DW_AT_TI_begin_file("main_pru1.c")
      63        .dwattr $C$DW$4, DW_AT_TI_begin_line(0x2e)
      64        .dwattr $C$DW$4, DW_AT_TI_begin_column(0x06)
      65        .dwattr $C$DW$4, DW_AT_decl_file("main_pru1.c")
      66        .dwattr $C$DW$4, DW_AT_decl_line(0x2e)
      67        .dwattr $C$DW$4, DW_AT_decl_column(0x06)
      68        .dwattr $C$DW$4, DW_AT_TI_max_frame_size(0x02)
      69        .dwpsn  file "main_pru1.c",line 47,column 1,is_stmt,address ||main||,isa 0
      70
      71        .dwfde $C$DW$CIE, ||main||
      72;----------------------------------------------------------------------
      73;  46 | void main(void)                                                        
      74;----------------------------------------------------------------------
      75
      76;***************************************************************
      77;* FNAME: main                          FR SIZE:   2           *
      78;*                                                             *
      79;* FUNCTION ENVIRONMENT                                        *
      80;*                                                             *
      81;* FUNCTION PROPERTIES                                         *
      82;*                            0 Auto,  2 SOE     *
      83;***************************************************************
      84
      85 00000000                 ||main||:
      86;* --------------------------------------------------------------------------*
      87        .dwcfi  cfa_offset, 0
      88 00000000 0000000502E2E2          SUB       r2, r2, 0x02          ; [ALU_PRU] 
      89        .dwcfi  cfa_offset, 2
      90        .dwpsn  file "main_pru1.c",line 49,column 2,is_stmt,isa 0
      91;----------------------------------------------------------------------
      92;  49 | CT_CFG.SYSCFG_bit.STANDBY_INIT = 0;                                    
      93;----------------------------------------------------------------------
      94 00000004 00000091042080!         LBCO      &r0, __PRU_CREG_PRU_CFG, $CSBREL(||CT_CFG||+4), 4 ; [ALU_PRU] |49| CT_CFG
      95 00000008 000000E10002C3          SBBO      &r3.b2, r2, 0, 2      ; [ALU_PRU] 
      96        .dwcfi  save_reg_to_mem, 14, -2
      97        .dwcfi  save_reg_to_mem, 15, -1
      98 0000000c 0000001D04E0E0          CLR       r0, r0, 0x00000004    ; [ALU_PRU] |49| 
      99 00000010 00000081042080!         SBCO      &r0, __PRU_CREG_PRU_CFG, $CSBREL(||CT_CFG||+4), 4 ; [ALU_PRU] |49| CT_CFG
     100        .dwpsn  file "main_pru1.c",line 51,column 2,is_stmt,isa 0
     101;----------------------------------------------------------------------
     102;  51 | start();                                                               
     103;----------------------------------------------------------------------
     104$C$DW$5 .dwtag  DW_TAG_TI_branch
     105        .dwattr $C$DW$5, DW_AT_low_pc(0x00)
     106        .dwattr $C$DW$5, DW_AT_name("start")
     107        .dwattr $C$DW$5, DW_AT_TI_call
     108 00000014 000000230000C3!         JAL       r3.w2, ||start||      ; [ALU_PRU] |51| start
     109 00000018 000000F10002C3          LBBO      &r3.b2, r2, 0, 2      ; [ALU_PRU] 
     110        .dwcfi  restore_reg, 14
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:41 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE    3

     111        .dwcfi  restore_reg, 15
     112 0000001c 0000000102E2E2          ADD       r2, r2, 0x02          ; [ALU_PRU] 
     113        .dwcfi  cfa_offset, 0
     114$C$DW$6 .dwtag  DW_TAG_TI_branch
     115        .dwattr $C$DW$6, DW_AT_low_pc(0x00)
     116        .dwattr $C$DW$6, DW_AT_TI_return
     117 00000020 00000020C30000          JMP       r3.w2                 ; [ALU_PRU] 
     118        .dwattr $C$DW$4, DW_AT_TI_end_file("main_pru1.c")
     119        .dwattr $C$DW$4, DW_AT_TI_end_line(0x34)
     120        .dwattr $C$DW$4, DW_AT_TI_end_column(0x01)
     121        .dwendentry
     122        .dwendtag $C$DW$4
     123
     124;*****************************************************************************
     125;* UNDEFINED EXTERNAL REFERENCES                                             *
     126;*****************************************************************************
     127        .global ||start||
     128
     129;******************************************************************************
     130;* TYPE INFORMATION                                                           *
     131;******************************************************************************
     132
     133$C$DW$T$19      .dwtag  DW_TAG_structure_type
     134        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
     135$C$DW$7 .dwtag  DW_TAG_member
     136        .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$11)
     137        .dwattr $C$DW$7, DW_AT_name("REVID")
     138        .dwattr $C$DW$7, DW_AT_TI_symbol_name("REVID")
     139        .dwattr $C$DW$7, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
     140        .dwattr $C$DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     141        .dwattr $C$DW$7, DW_AT_accessibility(DW_ACCESS_public)
     142        .dwattr $C$DW$7, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru_
     143        .dwattr $C$DW$7, DW_AT_decl_line(0x2d)
     144        .dwattr $C$DW$7, DW_AT_decl_column(0x0d)
     145        .dwendtag $C$DW$T$19
     146
     147        .dwattr $C$DW$T$19, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     148        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
     149        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
     150$C$DW$T$37      .dwtag  DW_TAG_volatile_type
     151        .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$19)
     152
     153$C$DW$T$20      .dwtag  DW_TAG_structure_type
     154        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     155$C$DW$8 .dwtag  DW_TAG_member
     156        .dwattr $C$DW$8, DW_AT_type(*$C$DW$T$11)
     157        .dwattr $C$DW$8, DW_AT_name("IDLE_MODE")
     158        .dwattr $C$DW$8, DW_AT_TI_symbol_name("IDLE_MODE")
     159        .dwattr $C$DW$8, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     160        .dwattr $C$DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     161        .dwattr $C$DW$8, DW_AT_accessibility(DW_ACCESS_public)
     162        .dwattr $C$DW$8, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru_
     163        .dwattr $C$DW$8, DW_AT_decl_line(0x37)
     164        .dwattr $C$DW$8, DW_AT_decl_column(0x0d)
     165$C$DW$9 .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:41 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE    4

     166        .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$11)
     167        .dwattr $C$DW$9, DW_AT_name("STANDBY_MODE")
     168        .dwattr $C$DW$9, DW_AT_TI_symbol_name("STANDBY_MODE")
     169        .dwattr $C$DW$9, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
     170        .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     171        .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     172        .dwattr $C$DW$9, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru_
     173        .dwattr $C$DW$9, DW_AT_decl_line(0x38)
     174        .dwattr $C$DW$9, DW_AT_decl_column(0x0d)
     175$C$DW$10        .dwtag  DW_TAG_member
     176        .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$11)
     177        .dwattr $C$DW$10, DW_AT_name("STANDBY_INIT")
     178        .dwattr $C$DW$10, DW_AT_TI_symbol_name("STANDBY_INIT")
     179        .dwattr $C$DW$10, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     180        .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     181        .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     182        .dwattr $C$DW$10, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     183        .dwattr $C$DW$10, DW_AT_decl_line(0x39)
     184        .dwattr $C$DW$10, DW_AT_decl_column(0x0d)
     185$C$DW$11        .dwtag  DW_TAG_member
     186        .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$11)
     187        .dwattr $C$DW$11, DW_AT_name("SUB_MWAIT")
     188        .dwattr $C$DW$11, DW_AT_TI_symbol_name("SUB_MWAIT")
     189        .dwattr $C$DW$11, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     190        .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     191        .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     192        .dwattr $C$DW$11, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     193        .dwattr $C$DW$11, DW_AT_decl_line(0x3a)
     194        .dwattr $C$DW$11, DW_AT_decl_column(0x0d)
     195$C$DW$12        .dwtag  DW_TAG_member
     196        .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$11)
     197        .dwattr $C$DW$12, DW_AT_name("rsvd6")
     198        .dwattr $C$DW$12, DW_AT_TI_symbol_name("rsvd6")
     199        .dwattr $C$DW$12, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1a)
     200        .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     201        .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     202        .dwattr $C$DW$12, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     203        .dwattr $C$DW$12, DW_AT_decl_line(0x3b)
     204        .dwattr $C$DW$12, DW_AT_decl_column(0x0d)
     205        .dwendtag $C$DW$T$20
     206
     207        .dwattr $C$DW$T$20, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     208        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
     209        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
     210$C$DW$T$39      .dwtag  DW_TAG_volatile_type
     211        .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$20)
     212
     213$C$DW$T$21      .dwtag  DW_TAG_structure_type
     214        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
     215$C$DW$13        .dwtag  DW_TAG_member
     216        .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$11)
     217        .dwattr $C$DW$13, DW_AT_name("PRU0_GPI_MODE")
     218        .dwattr $C$DW$13, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
     219        .dwattr $C$DW$13, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     220        .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:41 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE    5

     221        .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     222        .dwattr $C$DW$13, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     223        .dwattr $C$DW$13, DW_AT_decl_line(0x45)
     224        .dwattr $C$DW$13, DW_AT_decl_column(0x0d)
     225$C$DW$14        .dwtag  DW_TAG_member
     226        .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$11)
     227        .dwattr $C$DW$14, DW_AT_name("PRU0_GPI_CLK_MODE")
     228        .dwattr $C$DW$14, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
     229        .dwattr $C$DW$14, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     230        .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     231        .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     232        .dwattr $C$DW$14, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     233        .dwattr $C$DW$14, DW_AT_decl_line(0x46)
     234        .dwattr $C$DW$14, DW_AT_decl_column(0x0d)
     235$C$DW$15        .dwtag  DW_TAG_member
     236        .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$11)
     237        .dwattr $C$DW$15, DW_AT_name("PRU0_GPI_DIV0")
     238        .dwattr $C$DW$15, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
     239        .dwattr $C$DW$15, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     240        .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     241        .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     242        .dwattr $C$DW$15, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     243        .dwattr $C$DW$15, DW_AT_decl_line(0x47)
     244        .dwattr $C$DW$15, DW_AT_decl_column(0x0d)
     245$C$DW$16        .dwtag  DW_TAG_member
     246        .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$11)
     247        .dwattr $C$DW$16, DW_AT_name("PRU0_GPI_DIV1")
     248        .dwattr $C$DW$16, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
     249        .dwattr $C$DW$16, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     250        .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     251        .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     252        .dwattr $C$DW$16, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     253        .dwattr $C$DW$16, DW_AT_decl_line(0x48)
     254        .dwattr $C$DW$16, DW_AT_decl_column(0x0d)
     255$C$DW$17        .dwtag  DW_TAG_member
     256        .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$11)
     257        .dwattr $C$DW$17, DW_AT_name("PRU0_GPI_SB")
     258        .dwattr $C$DW$17, DW_AT_TI_symbol_name("PRU0_GPI_SB")
     259        .dwattr $C$DW$17, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     260        .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     261        .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     262        .dwattr $C$DW$17, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     263        .dwattr $C$DW$17, DW_AT_decl_line(0x49)
     264        .dwattr $C$DW$17, DW_AT_decl_column(0x0d)
     265$C$DW$18        .dwtag  DW_TAG_member
     266        .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$11)
     267        .dwattr $C$DW$18, DW_AT_name("PRU0_GPO_MODE")
     268        .dwattr $C$DW$18, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
     269        .dwattr $C$DW$18, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     270        .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     271        .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     272        .dwattr $C$DW$18, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     273        .dwattr $C$DW$18, DW_AT_decl_line(0x4a)
     274        .dwattr $C$DW$18, DW_AT_decl_column(0x0d)
     275$C$DW$19        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:41 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE    6

     276        .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$11)
     277        .dwattr $C$DW$19, DW_AT_name("PRU0_GPO_DIV0")
     278        .dwattr $C$DW$19, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
     279        .dwattr $C$DW$19, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     280        .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     281        .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     282        .dwattr $C$DW$19, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     283        .dwattr $C$DW$19, DW_AT_decl_line(0x4b)
     284        .dwattr $C$DW$19, DW_AT_decl_column(0x0d)
     285$C$DW$20        .dwtag  DW_TAG_member
     286        .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$11)
     287        .dwattr $C$DW$20, DW_AT_name("PRU0_GPO_DIV1")
     288        .dwattr $C$DW$20, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
     289        .dwattr $C$DW$20, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     290        .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     291        .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     292        .dwattr $C$DW$20, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     293        .dwattr $C$DW$20, DW_AT_decl_line(0x4c)
     294        .dwattr $C$DW$20, DW_AT_decl_column(0x0d)
     295$C$DW$21        .dwtag  DW_TAG_member
     296        .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$11)
     297        .dwattr $C$DW$21, DW_AT_name("PRU0_GPO_SH_SEL")
     298        .dwattr $C$DW$21, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
     299        .dwattr $C$DW$21, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     300        .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     301        .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     302        .dwattr $C$DW$21, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     303        .dwattr $C$DW$21, DW_AT_decl_line(0x4d)
     304        .dwattr $C$DW$21, DW_AT_decl_column(0x0d)
     305$C$DW$22        .dwtag  DW_TAG_member
     306        .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$11)
     307        .dwattr $C$DW$22, DW_AT_name("rsvd26")
     308        .dwattr $C$DW$22, DW_AT_TI_symbol_name("rsvd26")
     309        .dwattr $C$DW$22, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     310        .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     311        .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     312        .dwattr $C$DW$22, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     313        .dwattr $C$DW$22, DW_AT_decl_line(0x4e)
     314        .dwattr $C$DW$22, DW_AT_decl_column(0x0d)
     315        .dwendtag $C$DW$T$21
     316
     317        .dwattr $C$DW$T$21, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     318        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
     319        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
     320$C$DW$T$41      .dwtag  DW_TAG_volatile_type
     321        .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$21)
     322
     323$C$DW$T$22      .dwtag  DW_TAG_structure_type
     324        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
     325$C$DW$23        .dwtag  DW_TAG_member
     326        .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$11)
     327        .dwattr $C$DW$23, DW_AT_name("PRU1_GPI_MODE")
     328        .dwattr $C$DW$23, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
     329        .dwattr $C$DW$23, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     330        .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:41 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE    7

     331        .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     332        .dwattr $C$DW$23, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     333        .dwattr $C$DW$23, DW_AT_decl_line(0x58)
     334        .dwattr $C$DW$23, DW_AT_decl_column(0x0d)
     335$C$DW$24        .dwtag  DW_TAG_member
     336        .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$11)
     337        .dwattr $C$DW$24, DW_AT_name("PRU1_GPI_CLK_MODE")
     338        .dwattr $C$DW$24, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
     339        .dwattr $C$DW$24, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     340        .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     341        .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     342        .dwattr $C$DW$24, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     343        .dwattr $C$DW$24, DW_AT_decl_line(0x59)
     344        .dwattr $C$DW$24, DW_AT_decl_column(0x0d)
     345$C$DW$25        .dwtag  DW_TAG_member
     346        .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$11)
     347        .dwattr $C$DW$25, DW_AT_name("PRU1_GPI_DIV0")
     348        .dwattr $C$DW$25, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
     349        .dwattr $C$DW$25, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     350        .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     351        .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     352        .dwattr $C$DW$25, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     353        .dwattr $C$DW$25, DW_AT_decl_line(0x5a)
     354        .dwattr $C$DW$25, DW_AT_decl_column(0x0d)
     355$C$DW$26        .dwtag  DW_TAG_member
     356        .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$11)
     357        .dwattr $C$DW$26, DW_AT_name("PRU1_GPI_DIV1")
     358        .dwattr $C$DW$26, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
     359        .dwattr $C$DW$26, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     360        .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     361        .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     362        .dwattr $C$DW$26, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     363        .dwattr $C$DW$26, DW_AT_decl_line(0x5b)
     364        .dwattr $C$DW$26, DW_AT_decl_column(0x0d)
     365$C$DW$27        .dwtag  DW_TAG_member
     366        .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$11)
     367        .dwattr $C$DW$27, DW_AT_name("PRU1_GPI_SB")
     368        .dwattr $C$DW$27, DW_AT_TI_symbol_name("PRU1_GPI_SB")
     369        .dwattr $C$DW$27, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     370        .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     371        .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     372        .dwattr $C$DW$27, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     373        .dwattr $C$DW$27, DW_AT_decl_line(0x5c)
     374        .dwattr $C$DW$27, DW_AT_decl_column(0x0d)
     375$C$DW$28        .dwtag  DW_TAG_member
     376        .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$11)
     377        .dwattr $C$DW$28, DW_AT_name("PRU1_GPO_MODE")
     378        .dwattr $C$DW$28, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
     379        .dwattr $C$DW$28, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     380        .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     381        .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     382        .dwattr $C$DW$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     383        .dwattr $C$DW$28, DW_AT_decl_line(0x5d)
     384        .dwattr $C$DW$28, DW_AT_decl_column(0x0d)
     385$C$DW$29        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:41 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE    8

     386        .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$11)
     387        .dwattr $C$DW$29, DW_AT_name("PRU1_GPO_DIV0")
     388        .dwattr $C$DW$29, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
     389        .dwattr $C$DW$29, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     390        .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     391        .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     392        .dwattr $C$DW$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     393        .dwattr $C$DW$29, DW_AT_decl_line(0x5e)
     394        .dwattr $C$DW$29, DW_AT_decl_column(0x0d)
     395$C$DW$30        .dwtag  DW_TAG_member
     396        .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$11)
     397        .dwattr $C$DW$30, DW_AT_name("PRU1_GPO_DIV1")
     398        .dwattr $C$DW$30, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
     399        .dwattr $C$DW$30, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     400        .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     401        .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     402        .dwattr $C$DW$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     403        .dwattr $C$DW$30, DW_AT_decl_line(0x5f)
     404        .dwattr $C$DW$30, DW_AT_decl_column(0x0d)
     405$C$DW$31        .dwtag  DW_TAG_member
     406        .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$11)
     407        .dwattr $C$DW$31, DW_AT_name("PRU1_GPO_SH_SEL")
     408        .dwattr $C$DW$31, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
     409        .dwattr $C$DW$31, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     410        .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     411        .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     412        .dwattr $C$DW$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     413        .dwattr $C$DW$31, DW_AT_decl_line(0x60)
     414        .dwattr $C$DW$31, DW_AT_decl_column(0x0d)
     415$C$DW$32        .dwtag  DW_TAG_member
     416        .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$11)
     417        .dwattr $C$DW$32, DW_AT_name("rsvd26")
     418        .dwattr $C$DW$32, DW_AT_TI_symbol_name("rsvd26")
     419        .dwattr $C$DW$32, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     420        .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     421        .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     422        .dwattr $C$DW$32, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     423        .dwattr $C$DW$32, DW_AT_decl_line(0x61)
     424        .dwattr $C$DW$32, DW_AT_decl_column(0x0d)
     425        .dwendtag $C$DW$T$22
     426
     427        .dwattr $C$DW$T$22, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     428        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
     429        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
     430$C$DW$T$43      .dwtag  DW_TAG_volatile_type
     431        .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$22)
     432
     433$C$DW$T$23      .dwtag  DW_TAG_structure_type
     434        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
     435$C$DW$33        .dwtag  DW_TAG_member
     436        .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$11)
     437        .dwattr $C$DW$33, DW_AT_name("PRU0_CLK_STOP_REQ")
     438        .dwattr $C$DW$33, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
     439        .dwattr $C$DW$33, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     440        .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:41 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE    9

     441        .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     442        .dwattr $C$DW$33, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     443        .dwattr $C$DW$33, DW_AT_decl_line(0x6b)
     444        .dwattr $C$DW$33, DW_AT_decl_column(0x0d)
     445$C$DW$34        .dwtag  DW_TAG_member
     446        .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$11)
     447        .dwattr $C$DW$34, DW_AT_name("PRU0_CLK_STOP_ACK")
     448        .dwattr $C$DW$34, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
     449        .dwattr $C$DW$34, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
     450        .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     451        .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     452        .dwattr $C$DW$34, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     453        .dwattr $C$DW$34, DW_AT_decl_line(0x6c)
     454        .dwattr $C$DW$34, DW_AT_decl_column(0x0d)
     455$C$DW$35        .dwtag  DW_TAG_member
     456        .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$11)
     457        .dwattr $C$DW$35, DW_AT_name("PRU0_CLK_EN")
     458        .dwattr $C$DW$35, DW_AT_TI_symbol_name("PRU0_CLK_EN")
     459        .dwattr $C$DW$35, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     460        .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     461        .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     462        .dwattr $C$DW$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     463        .dwattr $C$DW$35, DW_AT_decl_line(0x6d)
     464        .dwattr $C$DW$35, DW_AT_decl_column(0x0d)
     465$C$DW$36        .dwtag  DW_TAG_member
     466        .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$11)
     467        .dwattr $C$DW$36, DW_AT_name("PRU1_CLK_STOP_REQ")
     468        .dwattr $C$DW$36, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
     469        .dwattr $C$DW$36, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
     470        .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     471        .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     472        .dwattr $C$DW$36, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     473        .dwattr $C$DW$36, DW_AT_decl_line(0x6e)
     474        .dwattr $C$DW$36, DW_AT_decl_column(0x0d)
     475$C$DW$37        .dwtag  DW_TAG_member
     476        .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$11)
     477        .dwattr $C$DW$37, DW_AT_name("PRU1_CLK_STOP_ACK")
     478        .dwattr $C$DW$37, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
     479        .dwattr $C$DW$37, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     480        .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     481        .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     482        .dwattr $C$DW$37, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     483        .dwattr $C$DW$37, DW_AT_decl_line(0x6f)
     484        .dwattr $C$DW$37, DW_AT_decl_column(0x0d)
     485$C$DW$38        .dwtag  DW_TAG_member
     486        .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$11)
     487        .dwattr $C$DW$38, DW_AT_name("PRU1_CLK_EN")
     488        .dwattr $C$DW$38, DW_AT_TI_symbol_name("PRU1_CLK_EN")
     489        .dwattr $C$DW$38, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     490        .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     491        .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     492        .dwattr $C$DW$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     493        .dwattr $C$DW$38, DW_AT_decl_line(0x70)
     494        .dwattr $C$DW$38, DW_AT_decl_column(0x0d)
     495$C$DW$39        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:41 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   10

     496        .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$11)
     497        .dwattr $C$DW$39, DW_AT_name("INTC_CLK_STOP_REQ")
     498        .dwattr $C$DW$39, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
     499        .dwattr $C$DW$39, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
     500        .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     501        .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     502        .dwattr $C$DW$39, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     503        .dwattr $C$DW$39, DW_AT_decl_line(0x71)
     504        .dwattr $C$DW$39, DW_AT_decl_column(0x0d)
     505$C$DW$40        .dwtag  DW_TAG_member
     506        .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$11)
     507        .dwattr $C$DW$40, DW_AT_name("INTC_CLK_STOP_ACK")
     508        .dwattr $C$DW$40, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
     509        .dwattr $C$DW$40, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
     510        .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     511        .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     512        .dwattr $C$DW$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     513        .dwattr $C$DW$40, DW_AT_decl_line(0x72)
     514        .dwattr $C$DW$40, DW_AT_decl_column(0x0d)
     515$C$DW$41        .dwtag  DW_TAG_member
     516        .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$11)
     517        .dwattr $C$DW$41, DW_AT_name("INTC_CLK_EN")
     518        .dwattr $C$DW$41, DW_AT_TI_symbol_name("INTC_CLK_EN")
     519        .dwattr $C$DW$41, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
     520        .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     521        .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     522        .dwattr $C$DW$41, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     523        .dwattr $C$DW$41, DW_AT_decl_line(0x73)
     524        .dwattr $C$DW$41, DW_AT_decl_column(0x0d)
     525$C$DW$42        .dwtag  DW_TAG_member
     526        .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$11)
     527        .dwattr $C$DW$42, DW_AT_name("UART_CLK_STOP_REQ")
     528        .dwattr $C$DW$42, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
     529        .dwattr $C$DW$42, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
     530        .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     531        .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     532        .dwattr $C$DW$42, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     533        .dwattr $C$DW$42, DW_AT_decl_line(0x74)
     534        .dwattr $C$DW$42, DW_AT_decl_column(0x0d)
     535$C$DW$43        .dwtag  DW_TAG_member
     536        .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$11)
     537        .dwattr $C$DW$43, DW_AT_name("UART_CLK_STOP_ACK")
     538        .dwattr $C$DW$43, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
     539        .dwattr $C$DW$43, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
     540        .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     541        .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     542        .dwattr $C$DW$43, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     543        .dwattr $C$DW$43, DW_AT_decl_line(0x75)
     544        .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
     545$C$DW$44        .dwtag  DW_TAG_member
     546        .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$11)
     547        .dwattr $C$DW$44, DW_AT_name("UART_CLK_EN")
     548        .dwattr $C$DW$44, DW_AT_TI_symbol_name("UART_CLK_EN")
     549        .dwattr $C$DW$44, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
     550        .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:41 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   11

     551        .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     552        .dwattr $C$DW$44, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     553        .dwattr $C$DW$44, DW_AT_decl_line(0x76)
     554        .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
     555$C$DW$45        .dwtag  DW_TAG_member
     556        .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$11)
     557        .dwattr $C$DW$45, DW_AT_name("ECAP_CLK_STOP_REQ")
     558        .dwattr $C$DW$45, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
     559        .dwattr $C$DW$45, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
     560        .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     561        .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     562        .dwattr $C$DW$45, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     563        .dwattr $C$DW$45, DW_AT_decl_line(0x77)
     564        .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
     565$C$DW$46        .dwtag  DW_TAG_member
     566        .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$11)
     567        .dwattr $C$DW$46, DW_AT_name("ECAP_CLK_STOP_ACK")
     568        .dwattr $C$DW$46, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
     569        .dwattr $C$DW$46, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     570        .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     571        .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     572        .dwattr $C$DW$46, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     573        .dwattr $C$DW$46, DW_AT_decl_line(0x78)
     574        .dwattr $C$DW$46, DW_AT_decl_column(0x0d)
     575$C$DW$47        .dwtag  DW_TAG_member
     576        .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$11)
     577        .dwattr $C$DW$47, DW_AT_name("ECAP_CLK_EN")
     578        .dwattr $C$DW$47, DW_AT_TI_symbol_name("ECAP_CLK_EN")
     579        .dwattr $C$DW$47, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     580        .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     581        .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     582        .dwattr $C$DW$47, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     583        .dwattr $C$DW$47, DW_AT_decl_line(0x79)
     584        .dwattr $C$DW$47, DW_AT_decl_column(0x0d)
     585$C$DW$48        .dwtag  DW_TAG_member
     586        .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$11)
     587        .dwattr $C$DW$48, DW_AT_name("IEP_CLK_STOP_REQ")
     588        .dwattr $C$DW$48, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
     589        .dwattr $C$DW$48, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
     590        .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     591        .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     592        .dwattr $C$DW$48, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     593        .dwattr $C$DW$48, DW_AT_decl_line(0x7a)
     594        .dwattr $C$DW$48, DW_AT_decl_column(0x0d)
     595$C$DW$49        .dwtag  DW_TAG_member
     596        .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$11)
     597        .dwattr $C$DW$49, DW_AT_name("IEP_CLK_STOP_ACK")
     598        .dwattr $C$DW$49, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
     599        .dwattr $C$DW$49, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     600        .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     601        .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     602        .dwattr $C$DW$49, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     603        .dwattr $C$DW$49, DW_AT_decl_line(0x7b)
     604        .dwattr $C$DW$49, DW_AT_decl_column(0x0d)
     605$C$DW$50        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:41 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   12

     606        .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$11)
     607        .dwattr $C$DW$50, DW_AT_name("IEP_CLK_EN")
     608        .dwattr $C$DW$50, DW_AT_TI_symbol_name("IEP_CLK_EN")
     609        .dwattr $C$DW$50, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     610        .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     611        .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     612        .dwattr $C$DW$50, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     613        .dwattr $C$DW$50, DW_AT_decl_line(0x7c)
     614        .dwattr $C$DW$50, DW_AT_decl_column(0x0d)
     615$C$DW$51        .dwtag  DW_TAG_member
     616        .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$11)
     617        .dwattr $C$DW$51, DW_AT_name("rsvd18")
     618        .dwattr $C$DW$51, DW_AT_TI_symbol_name("rsvd18")
     619        .dwattr $C$DW$51, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     620        .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     621        .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     622        .dwattr $C$DW$51, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     623        .dwattr $C$DW$51, DW_AT_decl_line(0x7d)
     624        .dwattr $C$DW$51, DW_AT_decl_column(0x0d)
     625        .dwendtag $C$DW$T$23
     626
     627        .dwattr $C$DW$T$23, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     628        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
     629        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
     630$C$DW$T$45      .dwtag  DW_TAG_volatile_type
     631        .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$23)
     632
     633$C$DW$T$24      .dwtag  DW_TAG_structure_type
     634        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
     635$C$DW$52        .dwtag  DW_TAG_member
     636        .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$11)
     637        .dwattr $C$DW$52, DW_AT_name("PRU0_IMEM_PE_RAW")
     638        .dwattr $C$DW$52, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
     639        .dwattr $C$DW$52, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     640        .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     641        .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     642        .dwattr $C$DW$52, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     643        .dwattr $C$DW$52, DW_AT_decl_line(0x87)
     644        .dwattr $C$DW$52, DW_AT_decl_column(0x0d)
     645$C$DW$53        .dwtag  DW_TAG_member
     646        .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$11)
     647        .dwattr $C$DW$53, DW_AT_name("PRU0_DMEM_PE_RAW")
     648        .dwattr $C$DW$53, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
     649        .dwattr $C$DW$53, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     650        .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     651        .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     652        .dwattr $C$DW$53, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     653        .dwattr $C$DW$53, DW_AT_decl_line(0x88)
     654        .dwattr $C$DW$53, DW_AT_decl_column(0x0d)
     655$C$DW$54        .dwtag  DW_TAG_member
     656        .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$11)
     657        .dwattr $C$DW$54, DW_AT_name("PRU1_IMEM_PE_RAW")
     658        .dwattr $C$DW$54, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
     659        .dwattr $C$DW$54, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     660        .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:41 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   13

     661        .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     662        .dwattr $C$DW$54, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     663        .dwattr $C$DW$54, DW_AT_decl_line(0x89)
     664        .dwattr $C$DW$54, DW_AT_decl_column(0x0d)
     665$C$DW$55        .dwtag  DW_TAG_member
     666        .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$11)
     667        .dwattr $C$DW$55, DW_AT_name("PRU1_DMEM_PE_RAW")
     668        .dwattr $C$DW$55, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
     669        .dwattr $C$DW$55, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     670        .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     671        .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     672        .dwattr $C$DW$55, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     673        .dwattr $C$DW$55, DW_AT_decl_line(0x8a)
     674        .dwattr $C$DW$55, DW_AT_decl_column(0x0d)
     675$C$DW$56        .dwtag  DW_TAG_member
     676        .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$11)
     677        .dwattr $C$DW$56, DW_AT_name("RAM_PE_RAW")
     678        .dwattr $C$DW$56, DW_AT_TI_symbol_name("RAM_PE_RAW")
     679        .dwattr $C$DW$56, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     680        .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     681        .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     682        .dwattr $C$DW$56, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     683        .dwattr $C$DW$56, DW_AT_decl_line(0x8b)
     684        .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
     685$C$DW$57        .dwtag  DW_TAG_member
     686        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
     687        .dwattr $C$DW$57, DW_AT_name("rsvd20")
     688        .dwattr $C$DW$57, DW_AT_TI_symbol_name("rsvd20")
     689        .dwattr $C$DW$57, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     690        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     691        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     692        .dwattr $C$DW$57, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     693        .dwattr $C$DW$57, DW_AT_decl_line(0x8c)
     694        .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
     695        .dwendtag $C$DW$T$24
     696
     697        .dwattr $C$DW$T$24, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     698        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
     699        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
     700$C$DW$T$47      .dwtag  DW_TAG_volatile_type
     701        .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$24)
     702
     703$C$DW$T$25      .dwtag  DW_TAG_structure_type
     704        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
     705$C$DW$58        .dwtag  DW_TAG_member
     706        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
     707        .dwattr $C$DW$58, DW_AT_name("PRU0_IMEM_PE")
     708        .dwattr $C$DW$58, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
     709        .dwattr $C$DW$58, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     710        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     711        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     712        .dwattr $C$DW$58, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     713        .dwattr $C$DW$58, DW_AT_decl_line(0x96)
     714        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
     715$C$DW$59        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:41 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   14

     716        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
     717        .dwattr $C$DW$59, DW_AT_name("PRU0_DMEM_PE")
     718        .dwattr $C$DW$59, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
     719        .dwattr $C$DW$59, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     720        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     721        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     722        .dwattr $C$DW$59, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     723        .dwattr $C$DW$59, DW_AT_decl_line(0x97)
     724        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
     725$C$DW$60        .dwtag  DW_TAG_member
     726        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
     727        .dwattr $C$DW$60, DW_AT_name("PRU1_IMEM_PE")
     728        .dwattr $C$DW$60, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
     729        .dwattr $C$DW$60, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     730        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     731        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     732        .dwattr $C$DW$60, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     733        .dwattr $C$DW$60, DW_AT_decl_line(0x98)
     734        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
     735$C$DW$61        .dwtag  DW_TAG_member
     736        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
     737        .dwattr $C$DW$61, DW_AT_name("PRU1_DMEM_PE")
     738        .dwattr $C$DW$61, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
     739        .dwattr $C$DW$61, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     740        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     741        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     742        .dwattr $C$DW$61, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     743        .dwattr $C$DW$61, DW_AT_decl_line(0x99)
     744        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
     745$C$DW$62        .dwtag  DW_TAG_member
     746        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
     747        .dwattr $C$DW$62, DW_AT_name("RAM_PE")
     748        .dwattr $C$DW$62, DW_AT_TI_symbol_name("RAM_PE")
     749        .dwattr $C$DW$62, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     750        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     751        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     752        .dwattr $C$DW$62, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     753        .dwattr $C$DW$62, DW_AT_decl_line(0x9a)
     754        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
     755$C$DW$63        .dwtag  DW_TAG_member
     756        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
     757        .dwattr $C$DW$63, DW_AT_name("rsvd20")
     758        .dwattr $C$DW$63, DW_AT_TI_symbol_name("rsvd20")
     759        .dwattr $C$DW$63, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     760        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     761        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     762        .dwattr $C$DW$63, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     763        .dwattr $C$DW$63, DW_AT_decl_line(0x9b)
     764        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
     765        .dwendtag $C$DW$T$25
     766
     767        .dwattr $C$DW$T$25, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     768        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
     769        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
     770$C$DW$T$49      .dwtag  DW_TAG_volatile_type
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:41 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   15

     771        .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$25)
     772
     773$C$DW$T$26      .dwtag  DW_TAG_structure_type
     774        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
     775$C$DW$64        .dwtag  DW_TAG_member
     776        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
     777        .dwattr $C$DW$64, DW_AT_name("PRU0_IMEM_PE_SET")
     778        .dwattr $C$DW$64, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
     779        .dwattr $C$DW$64, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     780        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     781        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     782        .dwattr $C$DW$64, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     783        .dwattr $C$DW$64, DW_AT_decl_line(0xa4)
     784        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
     785$C$DW$65        .dwtag  DW_TAG_member
     786        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
     787        .dwattr $C$DW$65, DW_AT_name("PRU0_DMEM_PE_SET")
     788        .dwattr $C$DW$65, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
     789        .dwattr $C$DW$65, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     790        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     791        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     792        .dwattr $C$DW$65, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     793        .dwattr $C$DW$65, DW_AT_decl_line(0xa5)
     794        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
     795$C$DW$66        .dwtag  DW_TAG_member
     796        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
     797        .dwattr $C$DW$66, DW_AT_name("PRU1_IMEM_PE_SET")
     798        .dwattr $C$DW$66, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
     799        .dwattr $C$DW$66, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     800        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     801        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     802        .dwattr $C$DW$66, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     803        .dwattr $C$DW$66, DW_AT_decl_line(0xa6)
     804        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
     805$C$DW$67        .dwtag  DW_TAG_member
     806        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
     807        .dwattr $C$DW$67, DW_AT_name("PRU1_DMEM_PE_SET")
     808        .dwattr $C$DW$67, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
     809        .dwattr $C$DW$67, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     810        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     811        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     812        .dwattr $C$DW$67, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     813        .dwattr $C$DW$67, DW_AT_decl_line(0xa7)
     814        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
     815$C$DW$68        .dwtag  DW_TAG_member
     816        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
     817        .dwattr $C$DW$68, DW_AT_name("RAM_PE_SET")
     818        .dwattr $C$DW$68, DW_AT_TI_symbol_name("RAM_PE_SET")
     819        .dwattr $C$DW$68, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     820        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     821        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     822        .dwattr $C$DW$68, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     823        .dwattr $C$DW$68, DW_AT_decl_line(0xa8)
     824        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
     825$C$DW$69        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:41 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   16

     826        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
     827        .dwattr $C$DW$69, DW_AT_name("rsvd20")
     828        .dwattr $C$DW$69, DW_AT_TI_symbol_name("rsvd20")
     829        .dwattr $C$DW$69, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     830        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     831        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     832        .dwattr $C$DW$69, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     833        .dwattr $C$DW$69, DW_AT_decl_line(0xa9)
     834        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
     835        .dwendtag $C$DW$T$26
     836
     837        .dwattr $C$DW$T$26, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     838        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
     839        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
     840$C$DW$T$51      .dwtag  DW_TAG_volatile_type
     841        .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$26)
     842
     843$C$DW$T$27      .dwtag  DW_TAG_structure_type
     844        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
     845$C$DW$70        .dwtag  DW_TAG_member
     846        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
     847        .dwattr $C$DW$70, DW_AT_name("PRU0_IMEM_PE_CLR")
     848        .dwattr $C$DW$70, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
     849        .dwattr $C$DW$70, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     850        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     851        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     852        .dwattr $C$DW$70, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     853        .dwattr $C$DW$70, DW_AT_decl_line(0xb3)
     854        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
     855$C$DW$71        .dwtag  DW_TAG_member
     856        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
     857        .dwattr $C$DW$71, DW_AT_name("PRU0_DMEM_PE_CLR")
     858        .dwattr $C$DW$71, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
     859        .dwattr $C$DW$71, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     860        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     861        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     862        .dwattr $C$DW$71, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     863        .dwattr $C$DW$71, DW_AT_decl_line(0xb4)
     864        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
     865$C$DW$72        .dwtag  DW_TAG_member
     866        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
     867        .dwattr $C$DW$72, DW_AT_name("PRU1_IMEM_PE_CLR")
     868        .dwattr $C$DW$72, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
     869        .dwattr $C$DW$72, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     870        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     871        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     872        .dwattr $C$DW$72, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     873        .dwattr $C$DW$72, DW_AT_decl_line(0xb5)
     874        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
     875$C$DW$73        .dwtag  DW_TAG_member
     876        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
     877        .dwattr $C$DW$73, DW_AT_name("PRU1_DMEM_PE_CLR")
     878        .dwattr $C$DW$73, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
     879        .dwattr $C$DW$73, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     880        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:41 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   17

     881        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     882        .dwattr $C$DW$73, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     883        .dwattr $C$DW$73, DW_AT_decl_line(0xb6)
     884        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
     885$C$DW$74        .dwtag  DW_TAG_member
     886        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
     887        .dwattr $C$DW$74, DW_AT_name("rsvd16")
     888        .dwattr $C$DW$74, DW_AT_TI_symbol_name("rsvd16")
     889        .dwattr $C$DW$74, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     890        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     891        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     892        .dwattr $C$DW$74, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     893        .dwattr $C$DW$74, DW_AT_decl_line(0xb7)
     894        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
     895        .dwendtag $C$DW$T$27
     896
     897        .dwattr $C$DW$T$27, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     898        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
     899        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
     900$C$DW$T$53      .dwtag  DW_TAG_volatile_type
     901        .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$27)
     902
     903$C$DW$T$28      .dwtag  DW_TAG_structure_type
     904        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
     905$C$DW$75        .dwtag  DW_TAG_member
     906        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
     907        .dwattr $C$DW$75, DW_AT_name("PMAO_PRU0")
     908        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PMAO_PRU0")
     909        .dwattr $C$DW$75, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     910        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     911        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     912        .dwattr $C$DW$75, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     913        .dwattr $C$DW$75, DW_AT_decl_line(0xc4)
     914        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
     915$C$DW$76        .dwtag  DW_TAG_member
     916        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
     917        .dwattr $C$DW$76, DW_AT_name("PMAO_PRU1")
     918        .dwattr $C$DW$76, DW_AT_TI_symbol_name("PMAO_PRU1")
     919        .dwattr $C$DW$76, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
     920        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     921        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     922        .dwattr $C$DW$76, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     923        .dwattr $C$DW$76, DW_AT_decl_line(0xc5)
     924        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
     925$C$DW$77        .dwtag  DW_TAG_member
     926        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
     927        .dwattr $C$DW$77, DW_AT_name("rsvd2")
     928        .dwattr $C$DW$77, DW_AT_TI_symbol_name("rsvd2")
     929        .dwattr $C$DW$77, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
     930        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     931        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     932        .dwattr $C$DW$77, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     933        .dwattr $C$DW$77, DW_AT_decl_line(0xc6)
     934        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
     935        .dwendtag $C$DW$T$28
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:41 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   18

     936
     937        .dwattr $C$DW$T$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     938        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
     939        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
     940$C$DW$T$55      .dwtag  DW_TAG_volatile_type
     941        .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$28)
     942
     943$C$DW$T$29      .dwtag  DW_TAG_structure_type
     944        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
     945$C$DW$78        .dwtag  DW_TAG_member
     946        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
     947        .dwattr $C$DW$78, DW_AT_name("OCP_EN")
     948        .dwattr $C$DW$78, DW_AT_TI_symbol_name("OCP_EN")
     949        .dwattr $C$DW$78, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     950        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     951        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     952        .dwattr $C$DW$78, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     953        .dwattr $C$DW$78, DW_AT_decl_line(0xd3)
     954        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
     955$C$DW$79        .dwtag  DW_TAG_member
     956        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
     957        .dwattr $C$DW$79, DW_AT_name("rsvd1")
     958        .dwattr $C$DW$79, DW_AT_TI_symbol_name("rsvd1")
     959        .dwattr $C$DW$79, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
     960        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     961        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     962        .dwattr $C$DW$79, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     963        .dwattr $C$DW$79, DW_AT_decl_line(0xd4)
     964        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
     965        .dwendtag $C$DW$T$29
     966
     967        .dwattr $C$DW$T$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     968        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
     969        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
     970$C$DW$T$57      .dwtag  DW_TAG_volatile_type
     971        .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$29)
     972
     973$C$DW$T$30      .dwtag  DW_TAG_structure_type
     974        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
     975$C$DW$80        .dwtag  DW_TAG_member
     976        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
     977        .dwattr $C$DW$80, DW_AT_name("PRU1_PAD_HP_EN")
     978        .dwattr $C$DW$80, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
     979        .dwattr $C$DW$80, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     980        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     981        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     982        .dwattr $C$DW$80, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     983        .dwattr $C$DW$80, DW_AT_decl_line(0xde)
     984        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
     985$C$DW$81        .dwtag  DW_TAG_member
     986        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
     987        .dwattr $C$DW$81, DW_AT_name("XFR_SHIFT_EN")
     988        .dwattr $C$DW$81, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
     989        .dwattr $C$DW$81, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
     990        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:41 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   19

     991        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     992        .dwattr $C$DW$81, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     993        .dwattr $C$DW$81, DW_AT_decl_line(0xdf)
     994        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
     995$C$DW$82        .dwtag  DW_TAG_member
     996        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
     997        .dwattr $C$DW$82, DW_AT_name("rsvd2")
     998        .dwattr $C$DW$82, DW_AT_TI_symbol_name("rsvd2")
     999        .dwattr $C$DW$82, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1000        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1001        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1002        .dwattr $C$DW$82, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1003        .dwattr $C$DW$82, DW_AT_decl_line(0xe0)
    1004        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1005        .dwendtag $C$DW$T$30
    1006
    1007        .dwattr $C$DW$T$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1008        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    1009        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    1010$C$DW$T$59      .dwtag  DW_TAG_volatile_type
    1011        .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$30)
    1012
    1013$C$DW$T$31      .dwtag  DW_TAG_structure_type
    1014        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1015$C$DW$83        .dwtag  DW_TAG_member
    1016        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1017        .dwattr $C$DW$83, DW_AT_name("PIN_MUX_SEL")
    1018        .dwattr $C$DW$83, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    1019        .dwattr $C$DW$83, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    1020        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1021        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1022        .dwattr $C$DW$83, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1023        .dwattr $C$DW$83, DW_AT_decl_line(0xec)
    1024        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1025$C$DW$84        .dwtag  DW_TAG_member
    1026        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1027        .dwattr $C$DW$84, DW_AT_name("rsvd2")
    1028        .dwattr $C$DW$84, DW_AT_TI_symbol_name("rsvd2")
    1029        .dwattr $C$DW$84, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
    1030        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1031        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1032        .dwattr $C$DW$84, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1033        .dwattr $C$DW$84, DW_AT_decl_line(0xed)
    1034        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1035        .dwendtag $C$DW$T$31
    1036
    1037        .dwattr $C$DW$T$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1038        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    1039        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    1040$C$DW$T$61      .dwtag  DW_TAG_volatile_type
    1041        .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$31)
    1042
    1043$C$DW$T$35      .dwtag  DW_TAG_structure_type
    1044        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    1045$C$DW$85        .dwtag  DW_TAG_member
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:41 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   20

    1046        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$38)
    1047        .dwattr $C$DW$85, DW_AT_name("$P$T0")
    1048        .dwattr $C$DW$85, DW_AT_TI_symbol_name("$P$T0")
    1049        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1050        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1051        .dwattr $C$DW$85, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1052        .dwattr $C$DW$85, DW_AT_decl_line(0x29)
    1053        .dwattr $C$DW$85, DW_AT_decl_column(0x02)
    1054$C$DW$86        .dwtag  DW_TAG_member
    1055        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$40)
    1056        .dwattr $C$DW$86, DW_AT_name("$P$T1")
    1057        .dwattr $C$DW$86, DW_AT_TI_symbol_name("$P$T1")
    1058        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1059        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1060        .dwattr $C$DW$86, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1061        .dwattr $C$DW$86, DW_AT_decl_line(0x33)
    1062        .dwattr $C$DW$86, DW_AT_decl_column(0x02)
    1063$C$DW$87        .dwtag  DW_TAG_member
    1064        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$42)
    1065        .dwattr $C$DW$87, DW_AT_name("$P$T2")
    1066        .dwattr $C$DW$87, DW_AT_TI_symbol_name("$P$T2")
    1067        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1068        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1069        .dwattr $C$DW$87, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1070        .dwattr $C$DW$87, DW_AT_decl_line(0x41)
    1071        .dwattr $C$DW$87, DW_AT_decl_column(0x02)
    1072$C$DW$88        .dwtag  DW_TAG_member
    1073        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$44)
    1074        .dwattr $C$DW$88, DW_AT_name("$P$T3")
    1075        .dwattr $C$DW$88, DW_AT_TI_symbol_name("$P$T3")
    1076        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1077        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1078        .dwattr $C$DW$88, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1079        .dwattr $C$DW$88, DW_AT_decl_line(0x54)
    1080        .dwattr $C$DW$88, DW_AT_decl_column(0x02)
    1081$C$DW$89        .dwtag  DW_TAG_member
    1082        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$46)
    1083        .dwattr $C$DW$89, DW_AT_name("$P$T4")
    1084        .dwattr $C$DW$89, DW_AT_TI_symbol_name("$P$T4")
    1085        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1086        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1087        .dwattr $C$DW$89, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1088        .dwattr $C$DW$89, DW_AT_decl_line(0x67)
    1089        .dwattr $C$DW$89, DW_AT_decl_column(0x02)
    1090$C$DW$90        .dwtag  DW_TAG_member
    1091        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$48)
    1092        .dwattr $C$DW$90, DW_AT_name("$P$T5")
    1093        .dwattr $C$DW$90, DW_AT_TI_symbol_name("$P$T5")
    1094        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1095        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1096        .dwattr $C$DW$90, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1097        .dwattr $C$DW$90, DW_AT_decl_line(0x83)
    1098        .dwattr $C$DW$90, DW_AT_decl_column(0x02)
    1099$C$DW$91        .dwtag  DW_TAG_member
    1100        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$50)
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:41 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   21

    1101        .dwattr $C$DW$91, DW_AT_name("$P$T6")
    1102        .dwattr $C$DW$91, DW_AT_TI_symbol_name("$P$T6")
    1103        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1104        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1105        .dwattr $C$DW$91, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1106        .dwattr $C$DW$91, DW_AT_decl_line(0x92)
    1107        .dwattr $C$DW$91, DW_AT_decl_column(0x02)
    1108$C$DW$92        .dwtag  DW_TAG_member
    1109        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$52)
    1110        .dwattr $C$DW$92, DW_AT_name("$P$T7")
    1111        .dwattr $C$DW$92, DW_AT_TI_symbol_name("$P$T7")
    1112        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1113        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1114        .dwattr $C$DW$92, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1115        .dwattr $C$DW$92, DW_AT_decl_line(0xa0)
    1116        .dwattr $C$DW$92, DW_AT_decl_column(0x02)
    1117$C$DW$93        .dwtag  DW_TAG_member
    1118        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$54)
    1119        .dwattr $C$DW$93, DW_AT_name("$P$T8")
    1120        .dwattr $C$DW$93, DW_AT_TI_symbol_name("$P$T8")
    1121        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1122        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1123        .dwattr $C$DW$93, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1124        .dwattr $C$DW$93, DW_AT_decl_line(0xaf)
    1125        .dwattr $C$DW$93, DW_AT_decl_column(0x02)
    1126$C$DW$94        .dwtag  DW_TAG_member
    1127        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$32)
    1128        .dwattr $C$DW$94, DW_AT_name("rsvd24")
    1129        .dwattr $C$DW$94, DW_AT_TI_symbol_name("rsvd24")
    1130        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1131        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1132        .dwattr $C$DW$94, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1133        .dwattr $C$DW$94, DW_AT_decl_line(0xbc)
    1134        .dwattr $C$DW$94, DW_AT_decl_column(0x0b)
    1135$C$DW$95        .dwtag  DW_TAG_member
    1136        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$56)
    1137        .dwattr $C$DW$95, DW_AT_name("$P$T9")
    1138        .dwattr $C$DW$95, DW_AT_TI_symbol_name("$P$T9")
    1139        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1140        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1141        .dwattr $C$DW$95, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1142        .dwattr $C$DW$95, DW_AT_decl_line(0xc0)
    1143        .dwattr $C$DW$95, DW_AT_decl_column(0x02)
    1144$C$DW$96        .dwtag  DW_TAG_member
    1145        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$33)
    1146        .dwattr $C$DW$96, DW_AT_name("rsvd2c")
    1147        .dwattr $C$DW$96, DW_AT_TI_symbol_name("rsvd2c")
    1148        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1149        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1150        .dwattr $C$DW$96, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1151        .dwattr $C$DW$96, DW_AT_decl_line(0xcb)
    1152        .dwattr $C$DW$96, DW_AT_decl_column(0x0b)
    1153$C$DW$97        .dwtag  DW_TAG_member
    1154        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$58)
    1155        .dwattr $C$DW$97, DW_AT_name("$P$T10")
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:41 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   22

    1156        .dwattr $C$DW$97, DW_AT_TI_symbol_name("$P$T10")
    1157        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1158        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1159        .dwattr $C$DW$97, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1160        .dwattr $C$DW$97, DW_AT_decl_line(0xcf)
    1161        .dwattr $C$DW$97, DW_AT_decl_column(0x02)
    1162$C$DW$98        .dwtag  DW_TAG_member
    1163        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$60)
    1164        .dwattr $C$DW$98, DW_AT_name("$P$T11")
    1165        .dwattr $C$DW$98, DW_AT_TI_symbol_name("$P$T11")
    1166        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1167        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1168        .dwattr $C$DW$98, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1169        .dwattr $C$DW$98, DW_AT_decl_line(0xda)
    1170        .dwattr $C$DW$98, DW_AT_decl_column(0x02)
    1171$C$DW$99        .dwtag  DW_TAG_member
    1172        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$34)
    1173        .dwattr $C$DW$99, DW_AT_name("rsvd38")
    1174        .dwattr $C$DW$99, DW_AT_TI_symbol_name("rsvd38")
    1175        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1176        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1177        .dwattr $C$DW$99, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1178        .dwattr $C$DW$99, DW_AT_decl_line(0xe5)
    1179        .dwattr $C$DW$99, DW_AT_decl_column(0x0b)
    1180$C$DW$100       .dwtag  DW_TAG_member
    1181        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$62)
    1182        .dwattr $C$DW$100, DW_AT_name("$P$T12")
    1183        .dwattr $C$DW$100, DW_AT_TI_symbol_name("$P$T12")
    1184        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1185        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1186        .dwattr $C$DW$100, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1187        .dwattr $C$DW$100, DW_AT_decl_line(0xe8)
    1188        .dwattr $C$DW$100, DW_AT_decl_column(0x02)
    1189        .dwendtag $C$DW$T$35
    1190
    1191        .dwattr $C$DW$T$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1192        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    1193        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1194$C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("pruCfg")
    1195        .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$35)
    1196        .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    1197        .dwattr $C$DW$T$68, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1198        .dwattr $C$DW$T$68, DW_AT_decl_line(0xf0)
    1199        .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    1200$C$DW$T$69      .dwtag  DW_TAG_volatile_type
    1201        .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    1202
    1203$C$DW$T$38      .dwtag  DW_TAG_union_type
    1204        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    1205$C$DW$101       .dwtag  DW_TAG_member
    1206        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$36)
    1207        .dwattr $C$DW$101, DW_AT_name("REVID")
    1208        .dwattr $C$DW$101, DW_AT_TI_symbol_name("REVID")
    1209        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1210        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:41 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   23

    1211        .dwattr $C$DW$101, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1212        .dwattr $C$DW$101, DW_AT_decl_line(0x2a)
    1213        .dwattr $C$DW$101, DW_AT_decl_column(0x15)
    1214$C$DW$102       .dwtag  DW_TAG_member
    1215        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$37)
    1216        .dwattr $C$DW$102, DW_AT_name("REVID_bit")
    1217        .dwattr $C$DW$102, DW_AT_TI_symbol_name("REVID_bit")
    1218        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1219        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1220        .dwattr $C$DW$102, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1221        .dwattr $C$DW$102, DW_AT_decl_line(0x2e)
    1222        .dwattr $C$DW$102, DW_AT_decl_column(0x05)
    1223        .dwendtag $C$DW$T$38
    1224
    1225        .dwattr $C$DW$T$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1226        .dwattr $C$DW$T$38, DW_AT_decl_line(0x29)
    1227        .dwattr $C$DW$T$38, DW_AT_decl_column(0x08)
    1228
    1229$C$DW$T$40      .dwtag  DW_TAG_union_type
    1230        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    1231$C$DW$103       .dwtag  DW_TAG_member
    1232        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$36)
    1233        .dwattr $C$DW$103, DW_AT_name("SYSCFG")
    1234        .dwattr $C$DW$103, DW_AT_TI_symbol_name("SYSCFG")
    1235        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1236        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1237        .dwattr $C$DW$103, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1238        .dwattr $C$DW$103, DW_AT_decl_line(0x34)
    1239        .dwattr $C$DW$103, DW_AT_decl_column(0x15)
    1240$C$DW$104       .dwtag  DW_TAG_member
    1241        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$39)
    1242        .dwattr $C$DW$104, DW_AT_name("SYSCFG_bit")
    1243        .dwattr $C$DW$104, DW_AT_TI_symbol_name("SYSCFG_bit")
    1244        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1245        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1246        .dwattr $C$DW$104, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1247        .dwattr $C$DW$104, DW_AT_decl_line(0x3c)
    1248        .dwattr $C$DW$104, DW_AT_decl_column(0x05)
    1249        .dwendtag $C$DW$T$40
    1250
    1251        .dwattr $C$DW$T$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1252        .dwattr $C$DW$T$40, DW_AT_decl_line(0x33)
    1253        .dwattr $C$DW$T$40, DW_AT_decl_column(0x08)
    1254
    1255$C$DW$T$42      .dwtag  DW_TAG_union_type
    1256        .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
    1257$C$DW$105       .dwtag  DW_TAG_member
    1258        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$36)
    1259        .dwattr $C$DW$105, DW_AT_name("GPCFG0")
    1260        .dwattr $C$DW$105, DW_AT_TI_symbol_name("GPCFG0")
    1261        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1262        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1263        .dwattr $C$DW$105, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1264        .dwattr $C$DW$105, DW_AT_decl_line(0x42)
    1265        .dwattr $C$DW$105, DW_AT_decl_column(0x15)
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:41 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   24

    1266$C$DW$106       .dwtag  DW_TAG_member
    1267        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$41)
    1268        .dwattr $C$DW$106, DW_AT_name("GPCFG0_bit")
    1269        .dwattr $C$DW$106, DW_AT_TI_symbol_name("GPCFG0_bit")
    1270        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1271        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1272        .dwattr $C$DW$106, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1273        .dwattr $C$DW$106, DW_AT_decl_line(0x4f)
    1274        .dwattr $C$DW$106, DW_AT_decl_column(0x05)
    1275        .dwendtag $C$DW$T$42
    1276
    1277        .dwattr $C$DW$T$42, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1278        .dwattr $C$DW$T$42, DW_AT_decl_line(0x41)
    1279        .dwattr $C$DW$T$42, DW_AT_decl_column(0x08)
    1280
    1281$C$DW$T$44      .dwtag  DW_TAG_union_type
    1282        .dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
    1283$C$DW$107       .dwtag  DW_TAG_member
    1284        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$36)
    1285        .dwattr $C$DW$107, DW_AT_name("GPCFG1")
    1286        .dwattr $C$DW$107, DW_AT_TI_symbol_name("GPCFG1")
    1287        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1288        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1289        .dwattr $C$DW$107, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1290        .dwattr $C$DW$107, DW_AT_decl_line(0x55)
    1291        .dwattr $C$DW$107, DW_AT_decl_column(0x15)
    1292$C$DW$108       .dwtag  DW_TAG_member
    1293        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$43)
    1294        .dwattr $C$DW$108, DW_AT_name("GPCFG1_bit")
    1295        .dwattr $C$DW$108, DW_AT_TI_symbol_name("GPCFG1_bit")
    1296        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1297        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1298        .dwattr $C$DW$108, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1299        .dwattr $C$DW$108, DW_AT_decl_line(0x62)
    1300        .dwattr $C$DW$108, DW_AT_decl_column(0x05)
    1301        .dwendtag $C$DW$T$44
    1302
    1303        .dwattr $C$DW$T$44, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1304        .dwattr $C$DW$T$44, DW_AT_decl_line(0x54)
    1305        .dwattr $C$DW$T$44, DW_AT_decl_column(0x08)
    1306
    1307$C$DW$T$46      .dwtag  DW_TAG_union_type
    1308        .dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
    1309$C$DW$109       .dwtag  DW_TAG_member
    1310        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$36)
    1311        .dwattr $C$DW$109, DW_AT_name("CGR")
    1312        .dwattr $C$DW$109, DW_AT_TI_symbol_name("CGR")
    1313        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1314        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1315        .dwattr $C$DW$109, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1316        .dwattr $C$DW$109, DW_AT_decl_line(0x68)
    1317        .dwattr $C$DW$109, DW_AT_decl_column(0x15)
    1318$C$DW$110       .dwtag  DW_TAG_member
    1319        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$45)
    1320        .dwattr $C$DW$110, DW_AT_name("CGR_bit")
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:41 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   25

    1321        .dwattr $C$DW$110, DW_AT_TI_symbol_name("CGR_bit")
    1322        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1323        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1324        .dwattr $C$DW$110, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1325        .dwattr $C$DW$110, DW_AT_decl_line(0x7e)
    1326        .dwattr $C$DW$110, DW_AT_decl_column(0x05)
    1327        .dwendtag $C$DW$T$46
    1328
    1329        .dwattr $C$DW$T$46, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1330        .dwattr $C$DW$T$46, DW_AT_decl_line(0x67)
    1331        .dwattr $C$DW$T$46, DW_AT_decl_column(0x08)
    1332
    1333$C$DW$T$48      .dwtag  DW_TAG_union_type
    1334        .dwattr $C$DW$T$48, DW_AT_byte_size(0x04)
    1335$C$DW$111       .dwtag  DW_TAG_member
    1336        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$36)
    1337        .dwattr $C$DW$111, DW_AT_name("ISRP")
    1338        .dwattr $C$DW$111, DW_AT_TI_symbol_name("ISRP")
    1339        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1340        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1341        .dwattr $C$DW$111, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1342        .dwattr $C$DW$111, DW_AT_decl_line(0x84)
    1343        .dwattr $C$DW$111, DW_AT_decl_column(0x15)
    1344$C$DW$112       .dwtag  DW_TAG_member
    1345        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$47)
    1346        .dwattr $C$DW$112, DW_AT_name("ISRP_bit")
    1347        .dwattr $C$DW$112, DW_AT_TI_symbol_name("ISRP_bit")
    1348        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1349        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1350        .dwattr $C$DW$112, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1351        .dwattr $C$DW$112, DW_AT_decl_line(0x8d)
    1352        .dwattr $C$DW$112, DW_AT_decl_column(0x05)
    1353        .dwendtag $C$DW$T$48
    1354
    1355        .dwattr $C$DW$T$48, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1356        .dwattr $C$DW$T$48, DW_AT_decl_line(0x83)
    1357        .dwattr $C$DW$T$48, DW_AT_decl_column(0x08)
    1358
    1359$C$DW$T$50      .dwtag  DW_TAG_union_type
    1360        .dwattr $C$DW$T$50, DW_AT_byte_size(0x04)
    1361$C$DW$113       .dwtag  DW_TAG_member
    1362        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$36)
    1363        .dwattr $C$DW$113, DW_AT_name("ISP")
    1364        .dwattr $C$DW$113, DW_AT_TI_symbol_name("ISP")
    1365        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1366        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1367        .dwattr $C$DW$113, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1368        .dwattr $C$DW$113, DW_AT_decl_line(0x93)
    1369        .dwattr $C$DW$113, DW_AT_decl_column(0x15)
    1370$C$DW$114       .dwtag  DW_TAG_member
    1371        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$49)
    1372        .dwattr $C$DW$114, DW_AT_name("ISP_bit")
    1373        .dwattr $C$DW$114, DW_AT_TI_symbol_name("ISP_bit")
    1374        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1375        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:41 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   26

    1376        .dwattr $C$DW$114, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1377        .dwattr $C$DW$114, DW_AT_decl_line(0x9c)
    1378        .dwattr $C$DW$114, DW_AT_decl_column(0x05)
    1379        .dwendtag $C$DW$T$50
    1380
    1381        .dwattr $C$DW$T$50, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1382        .dwattr $C$DW$T$50, DW_AT_decl_line(0x92)
    1383        .dwattr $C$DW$T$50, DW_AT_decl_column(0x08)
    1384
    1385$C$DW$T$52      .dwtag  DW_TAG_union_type
    1386        .dwattr $C$DW$T$52, DW_AT_byte_size(0x04)
    1387$C$DW$115       .dwtag  DW_TAG_member
    1388        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$36)
    1389        .dwattr $C$DW$115, DW_AT_name("IESP")
    1390        .dwattr $C$DW$115, DW_AT_TI_symbol_name("IESP")
    1391        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1392        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1393        .dwattr $C$DW$115, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1394        .dwattr $C$DW$115, DW_AT_decl_line(0xa1)
    1395        .dwattr $C$DW$115, DW_AT_decl_column(0x15)
    1396$C$DW$116       .dwtag  DW_TAG_member
    1397        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$51)
    1398        .dwattr $C$DW$116, DW_AT_name("IESP_bit")
    1399        .dwattr $C$DW$116, DW_AT_TI_symbol_name("IESP_bit")
    1400        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1401        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1402        .dwattr $C$DW$116, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1403        .dwattr $C$DW$116, DW_AT_decl_line(0xaa)
    1404        .dwattr $C$DW$116, DW_AT_decl_column(0x05)
    1405        .dwendtag $C$DW$T$52
    1406
    1407        .dwattr $C$DW$T$52, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1408        .dwattr $C$DW$T$52, DW_AT_decl_line(0xa0)
    1409        .dwattr $C$DW$T$52, DW_AT_decl_column(0x08)
    1410
    1411$C$DW$T$54      .dwtag  DW_TAG_union_type
    1412        .dwattr $C$DW$T$54, DW_AT_byte_size(0x04)
    1413$C$DW$117       .dwtag  DW_TAG_member
    1414        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$36)
    1415        .dwattr $C$DW$117, DW_AT_name("IECP")
    1416        .dwattr $C$DW$117, DW_AT_TI_symbol_name("IECP")
    1417        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1418        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1419        .dwattr $C$DW$117, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1420        .dwattr $C$DW$117, DW_AT_decl_line(0xb0)
    1421        .dwattr $C$DW$117, DW_AT_decl_column(0x15)
    1422$C$DW$118       .dwtag  DW_TAG_member
    1423        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$53)
    1424        .dwattr $C$DW$118, DW_AT_name("IECP_bit")
    1425        .dwattr $C$DW$118, DW_AT_TI_symbol_name("IECP_bit")
    1426        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1427        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1428        .dwattr $C$DW$118, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1429        .dwattr $C$DW$118, DW_AT_decl_line(0xb8)
    1430        .dwattr $C$DW$118, DW_AT_decl_column(0x05)
PRU Assembler Unix v2.1.4 Sun Apr  9 14:25:41 2017

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
main_pru1.asm                                                        PAGE   27

    1431        .dwendtag $C$DW$T$54
    1432
    1433        .dwattr $C$DW$T$54, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1434        .dwattr $C$DW$T$54, DW_AT_decl_line(0xaf)
    1435        .dwattr $C$DW$T$54, DW_AT_decl_column(0x08)
    1436
    1437$C$DW$T$56      .dwtag  DW_TAG_union_type
    1438        .dwattr $C$DW$T$56, DW_AT_byte_size(0x04)
    1439$C$DW$119       .dwtag  DW_TAG_member
    1440        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$36)
    1441        .dwattr $C$DW$119, DW_AT_name("PMAO")
    1442        .dwattr $C$DW$119, DW_AT_TI_symbol_name("PMAO")
    1443        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1444        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1445        .dwattr $C$DW$119, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1446        .dwattr $C$DW$119, DW_AT_decl_line(0xc1)
    1447        .dwattr $C$DW$119, DW_AT_decl_column(0x15)
    1448$C$DW$120       .dwtag  DW_TAG_member
    1449        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$55)
    1450        .dwattr $C$DW$120, DW_AT_name("PMAO_bit")
    1451        .dwattr $C$DW$120, DW_AT_TI_symbol_name("PMAO_bit")
    1452        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1453        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1454        .dwattr $C$DW$120, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1455        .dwattr $C$DW$120, DW_AT_decl_line(0xc7)
    1456        .dwattr $C$DW$120, DW_AT_decl_column(0x05)
    1457        .dwendtag $C$DW$T$56
    1458
    1459        .dwattr $C$DW$T$56, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1460        .dwattr $C$DW$T$56, DW_AT_decl_line(0xc0)
    1461        .dwattr $C$DW$T$56, DW_AT_decl_column(0x08)
    1462
    1463$C$DW$T$58      .dwtag  DW_TAG_union_type
    1464        .dwattr $C$DW$T$58, DW_AT_byte_size(0x04)
    1465$C$DW$121       .dwtag  DW_TAG_member
    1466        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$36)
    1467        .dwattr $C$DW$121, DW_AT_name("IEPCLK")
    1468        .dwattr $C$DW$121, DW_AT_TI_symbol_name("IEPCLK")
    1469        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1470        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
